[
  {
    "number": 1,
    "title": "Network Foundations and Basic Tools (Fundamentals Part I)",
    "focus": "Build a strong foundation in basic networking concepts and terminology. By the end of Month 1, you should understand how networks operate at a fundamental level (OSI and TCP/IP models, what routers and switches do, basics of IP addressing) and have your study/lab environment set up. We’ll also start doing simple labs in Packet Tracer to cement concepts. Domains covered: Primarily Network Fundamentals (CCNA domain 1.0), plus basic hands-on skills.",
    "weeks": [
      {
        "number": 1,
        "title": "Introduction to Networking & Lab Setup",
        "content": "Objectives (Week 1):\n- Grasp the  basics of computer networks  – what networks are, client/server model, the Internet\nstructure, and common network terminology (LAN, WAN, bandwidth, latency).\n- Learn about key  network components  and their roles:  routers, switches, firewalls, access points, end\ndevices (PCs, servers) . Be able to explain how each contributes to moving data.\n-  Understand  the  OSI  7-layer  model  vs  TCP/IP  model ,  and  how  data  flows  through  the  layers\n(encapsulation/de-encapsulation). Identify which layers correspond to which devices (e.g. switch = Layer\n2, router = Layer 3).\n- Set up your  lab environment : install Cisco Packet Tracer (or alternative) and familiarize with its\ninterface. Verify you can create a simple two-node network and ping between devices.\n- Establish a note-taking and study routine: create a Notion page or notebook for Week 1 notes, and set\nup Anki with a few starter flashcards (e.g. OSI layers, definitions of router/switch).\nResources:\n- Videos/Tutorials:\n- “CCNA Zero-to-One: Intro to Networking”  (free YouTube, 20 min) – High-level introduction to what\nnetworks are and the components involved (search “NetworkChuck what is a network”).\n- Jeremy’s IT Lab Day 1 – Network Devices  (YouTube, ~30 min) – Covers different network device types\nand where they operate . Jeremy’s IT Lab is a free comprehensive CCNA video course (we’ll use\nmany of his videos).\n- Cisco Networking Academy Introduction  – If enrolled in Cisco NetAcad (free), complete Chapter 1:\nNetworking Today  from the Introduction to Networks v7  course (covers network components, topology\nexamples, etc.). This provides structured content and quizzes.\n- (Optional) “OSI Model Explained”  by Practical Networking (YouTube, 15 min) – Excellent visualization\nof OSI layers and encapsulation.\nBooks/Chapters:5\n7273\n•\n3\n\nCCNA 200-301 Official Cert Guide (Vol. 1)  by Wendell Odom – Read Chapter 1: Networking Today\n(overview of network components and basic concepts) and Chapter 2: Networking Models  (OSI\nand TCP/IP models). Take notes on the purpose of each OSI layer .\nComputer Networking: A Top-Down Approach  by Kurose & Ross – Skim Section 1.1: What is the\nInternet?  and 1.3:  Network Edge and Core . This gives a broader context of how networks are\nstructured (nice to know, even if not directly tested).\nResearch Papers/Articles:\n“A Brief History of the Internet”  – (Leiner et al., 2009) – Internet Society  article outlining how\nnetworks evolved. Read sections on the early ARPANET to appreciate why protocols and models\nwere developed. (Good for motivation and context; not directly examinable.)\n“OSI Model Reference Chart”  (Cisco Learning Network) – A concise chart describing all 7 OSI\nlayers with examples . Use this to quiz yourself on layer functions.\n(Industry  whitepaper) “Demystifying  SDN  for  the  Network  Engineer”  –  Cisco  whitepaper\nintroducing Software-Defined Networking in simple terms. Just read the intro to glimpse future\ntrends (you’ll revisit SDN in Month 5).\nOnline Courses:\nCisco Networking Academy – Introduction to Networks (ITN) v7 : If you prefer a guided\ncourse, sign up (free) and complete Module 1: Networking Today  and Module 2: Basic Switch and\nEnd Device Configuration . These include lab exercises on Packet Tracer .\nfreeCodeCamp’s 4-hour Networking Basics Course  (YouTube) – If you want more lecture-style\nteaching on fundamentals and OSI, this video is a great supplement (covers networking basics in\na beginner-friendly way).\nHands-On Labs/Projects:\nLab 1.1: Build Your First Network  – Using Packet Tracer , create a simple network: two PCs\nconnected by a switch. Assign IP addresses (e.g. PC1: 10.0.0.1/24, PC2: 10.0.0.2/24), and use the\nPT simulation mode to send a ping. Observe the encapsulation (OSI layers) in the simulation\nview as the ping travels . Step-by-step:  Place two PC endpoints and one switch in PT, connect\nvia copper straight-through cables, configure IP addresses on PCs, then ping. Expected\noutcome:  PCs can ping each other successfully. Document in your notes: screenshots of your\nPacket Tracer topology and a brief explanation of what each device/layer did to deliver the ping.\nLab 1.2: Exploring Packet Tracer and CLI  – In Packet Tracer , add a Cisco 2960 switch and\nconsole into it from a PC (using a console cable). Practice using the Cisco CLI: enter show\nversion , show ip interface brief . No configuration needed, just get used to CLI\nnavigation (we’ll do more in Week 2).\n(Mini-Project) Home Network Mapping:  Draw a diagram of your own home network (router , Wi-\nFi AP, any devices). Identify what OSI layer each component operates at and how they connect.\nThis personalizes concepts like modem (Layer1/2), wireless router (Layer3), etc.\nQuizzes/Assessments:\nCCNA Prep Quiz – Basics (≈20 questions) : Take a beginner quiz on network basics (try the free\nquiz on ExamCompass or ExamTopics’ easy questions). Aim for 80%+. •\n•\n•\n•\n•\n74\n•\n•\n•\n•\n•\n•\n75\n•\n•\n•\n•\n4\n\nNetAcad Chapter Quiz:  If using NetAcad, complete the Module 1 quiz to test terminology.\nCreate 5 flashcards in Anki for OSI layers (e.g. “Layer 3 name?” -> “Network layer – IP addressing,\nrouting”). Review these at week’s end, using spaced repetition.\nTime Allocation (approx 12 hours):\n- Videos/lectures: ~3 hours (introductions, OSI model explanations).\n- Reading (Odom chapters, Kurose intro): ~2 hours.\n- Labs/Hands-on: ~4 hours (Packet Tracer setup and 2 labs, including documentation).\n- Quizzes/Review: ~2 hours (quiz + flashcards + reviewing notes).\n- Buffer/Break:  ~1 hour (spread as short breaks or an extra rest day if content is mastered quickly).\nMilestones & Checkpoints:\n-  Milestone 1:  Write a one-page summary or  blog-style note  explaining “How data moves from one\ncomputer to another over a network,” referencing the OSI model. If you can teach it simply, that’s a\ngreat sign of understanding.\n-  Milestone 2:  Submit your  Lab 1.1 report  – e.g., a screenshot of your Packet Tracer network with a\nbrief description of your ping results and what layers were involved.\n- Score at least 80% on the basic networking quiz  (or identify wrong answers and clarify why).\n-  Checkpoint:  Ensure Packet Tracer is working and you’re comfortable adding devices and using the\nsimulation mode. Also verify your note-taking system (Notion/OneNote) is set up with Week 1 content\nneatly organized.\nMotivation:  Congratulations on starting! Networking might seem overwhelming at first, but remember\nthat every expert was once a beginner . You’ve learned a lot of new terms this week – celebrate that. If\nsome concepts (like OSI layers) still feel abstract, that’s okay; we will reinforce them in upcoming weeks.\nTake a short break before Week 2, and get ready to dive deeper ."
      },
      {
        "number": 2,
        "title": "Network Fundamentals – Protocols and Models",
        "content": "Objectives (Week 2):\n-  Deepen  your  understanding  of  network  models  and  protocols:  specifically,  know  the  difference\nbetween TCP and UDP  (when to use each, characteristics like reliability vs speed) .\n- Learn about common  protocols at each layer  (e.g. Ethernet at Layer2, IP at Layer3, TCP/UDP at\nLayer4, HTTP/FTP at Layer7) and how they relate to the CCNA blueprint.\n- Master the concept of  encapsulation : how data is packaged at each layer (e.g. what a “packet” vs\n“frame” vs “segment” is).\n- Get introduced to basic device configuration: practice using Cisco IOS CLI commands for initial switch\nsetup  (hostname, interface descriptions, etc.) to prepare for upcoming network access topics.\n- Start learning about Cabling and Interfaces : types of network media (fiber vs copper , Ethernet cable\ncategories)  and where they are used. Identify different interface types on routers/switches in Packet\nTracer .\nResources:\n- Videos/Tutorials:\n-  “TCP vs UDP”  by NetworkChuck (YouTube, 15 min) – Fun, visual comparison of TCP and UDP using\nanalogies (e.g. phone call vs mail). Helps solidify why both exist and their pros/cons.\n- Jeremy’s IT Lab Day 3 – OSI Model & TCP/IP  (YouTube, 32 min) – Goes through encapsulation and\nPDUs (protocol data units) at each layer , and specifically touches on TCP vs UDP.\n- CBT Nuggets “TCP/IP Fundamentals”  (if you have access, ~20 min) – An optional polished video on\nhow the TCP/IP stack works, featuring real-world examples. (If no access, the above free videos suffice.)\n- (Optional) “How to Use Packet Tracer – Basic CLI”  (Cisco DevNet video, 10 min) – Shows how to open•\n•\n8\n7\n7677\n5\n\nthe CLI in Packet Tracer and do basic config. This overlaps with NetAcad content if you are following\nthat.\nBooks/Chapters:\nCCNA Official Cert Guide (Vol. 1)  – Read Chapter 3: Protocols and Models . Focus on sections\ncovering TCP/IP vs OSI, encapsulation example, and a short section on TCP vs UDP. Also read\nChapter 4: Physical Layer  (to learn about cabling and media).\n“Networking Essentials” by Cisco Press  (optional if available) – Chapter on Networking Protocols\nand Communications . It’s a lighter read reinforcing similar concepts with examples.\nQuick  reference:  RFC  791  (IPv4)  and  RFC  793  (TCP)  –  Skim  the  intro  paragraphs  of  these\nfoundational documents to see how they describe these protocols (don’t worry about deep\ndetails; this is just to experience reading an RFC).\nResearch Papers/Articles:\n“Understanding TCP/IP”  – an article on NetworkingAcademy.io or similar resource that explains\nhow TCP/IP model maps to OSI layers and the role of protocols at each layer (if you have\nNetAcad, the course content itself is great).\nIEEE Spectrum: “Wi-Fi & Ethernet: A History”  – A short article describing how Ethernet and Wi-\nFi standards came to be. This gives insight into why certain cabling (coax, twisted-pair , fiber) and\nwireless channels matter .\n(Academic) “End-to-End Arguments in System Design”  (Saltzer , Reed, Clark, 1984) – This seminal\npaper introduced the principle that reliability should be handled end-to-end (which underpins\nwhy TCP does error checking). Optional:  Read the first 2 pages to grasp the idea behind protocols\nlike TCP providing reliability rather than relying on network core.\nOnline Courses:\nCisco NetAcad – ITN v7 Module 3: Protocols and Models  – Goes through encapsulation\nprocess with examples; includes interactive activities. Complete Packet Tracer Activity “3.5.5:\nInvestigate the TCP/IP and OSI Models in Action” (this is a guided PT sim where you trace a web\nrequest through layers) .\nCoursera  “Computer  Communications”  Week  1  (Princeton  via  Coursera,  can  audit)  –  This\noffers another explanation of layering and introduces Internet design principles. A different\nperspective can reinforce learning.\nHands-On Labs/Projects:\nLab 2.1: Inspecting Packets in Wireshark  – Install Wireshark  (free packet analyzer). Use Packet\nTracer’s built-in Sniffer or your own PC’s ping. In PT: connect a PC to a PT Cloud (internet) and\ngenerate traffic, capture it. Alternatively, on your actual computer , ping a site and capture in\nWireshark. Inspect an ICMP packet: identify the Ethernet frame header , IP header , and ICMP\ndata. Expected Outcome:  You can see the different protocol headers layered (Ethernet contains\nIP which contains ICMP). Take a screenshot labeling the layers.\nLab 2.2: Basic Switch Configuration  – In Packet Tracer , place a 2960 switch and a PC. On the\nswitch CLI, practice commands: set hostname ( hostname Week2Switch ), set a banner\nmessage ( banner motd \"Authorized Access Only\" ), configure an IP on the switch’s\nVLAN1 interface (e.g. 192.168.1.10/24) so you could manage it, and set up a login password on•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n78\n•\n•\n•\n•\n6\n\nthe console. Also practice the show interface status  and show running-config .\nExpected Outcome:  You become familiar with user EXEC vs config mode, and you have a switch\nwith basic settings. Save the PT file for reuse.\nLab 2.3: Media Demonstration  – If you have different cable types in Packet Tracer (copper\nstraight-through vs crossover vs fiber), set up a simple test: e.g. connect two switches with the\nwrong cable type and observe link down, then correct it. This will reinforce cable differences\n(Copper crossover for switch-switch if no auto-MDIX, fiber needs fiber ports, etc.).\nQuizzes/Assessments:\nWeek 2 Quiz (30 questions)  – Covering OSI vs TCP/IP layers, protocol examples, TCP vs UDP\ndifferences, and basic Cisco CLI commands. Sources: Try creating a custom quiz in a tool like\nQuizlet, or use exam prep books’ chapter questions. Ensure you can answer: “Which OSI layer\ndoes XYZ occur?”, “What’s the advantage of TCP over UDP and vice versa?”, “Which cable for\nconnecting two switches?” etc.\nNetAcad Module 3 Quiz  if using NetAcad.\nContinue adding to Anki: e.g. flashcards for “TCP vs UDP – which is connection-oriented?”,\n“Default port for HTTP?”, “Command to set switch hostname?”, etc. Aim for ~15 new flashcards\nthis week.\nTime Allocation (~13 hours):\n- Videos: ~3 hours (models, protocols, TCP/UDP)\n- Reading: ~3 hours (Cert Guide chapters, articles)\n- Labs/Practice: ~4 hours (Wireshark hands-on, switch CLI config, cable experiments)\n- Quizzes/Flashcards/Review: ~2–3 hours (includes Anki and discussing tricky quiz answers in forums or\nstudy group)\nMilestones & Checkpoints:\n- Milestone 1:  Write a short explanation (half-page) comparing TCP vs UDP  in your own words. Include\nan example application for each (e.g. “TCP for HTTP web pages because…, UDP for live video streaming\nbecause…”). This checks your understanding of reliability vs speed trade-offs.\n-  Milestone 2:  Complete the Wireshark lab and save a screenshot of a dissected packet. Label the\nEthernet, IP, and TCP/UDP headers in your screenshot as a mini-report.\n- Milestone 3:  Configure a Packet Tracer switch with a hostname and IP, and successfully ping it from\na connected PC  (means your config was correct). Save this PT file as “Week2_SwitchConfig.pt”.\n- Achieve at least 25/30  on the Week 2 Quiz. For any missed questions, write down an explanation after\nresearching the answer – this will turn mistakes into learning.\n- Checkpoint:  You should now be comfortable with fundamental terminology and able to navigate the\nCLI basics. If terms like “encapsulation”, “segment vs packet”, or any layer functions are still confusing,\nrevisit the OSI chart or ask for clarification on forums (Cisco Learning Network community is helpful).\nMotivation:  Two weeks in, great work! At this point you’ve laid the groundwork that many find abstract –\nbut these concepts pay off later when we configure protocols. Keep remembering why you’re doing\nthis: each protocol or model piece you master is a tool in your belt for real-world troubleshooting. If\nyou find yourself struggling, don’t hesitate to revisit resources or try a different medium (video vs text).\nThe next couple of weeks we’ll dive into IP addressing – arguably the heart of networking. Stay curious\nand keep up the momentum!•\n•\n•\n•\n•\n7"
      },
      {
        "number": 3,
        "title": "IP Addressing & Subnetting (Fundamentals Part II)",
        "content": "Objectives (Week 3):\n-  Understand  IPv4  addressing  thoroughly:  the  format  of  an  IPv4  address,  binary  representation,\nnetwork vs host portions, and the role of the subnet mask.\n- Learn how to  subnet  IPv4 networks: given requirements (like X subnets or Y hosts), be able to\ncalculate appropriate subnet masks, network IDs, broadcast addresses, etc. This is a crucial skill for the\nexam and real life.\n- Practice configuring IP addresses on devices (routers, PCs) and verify connectivity within and across\nsubnets.\n- Get introduced to  private IP vs public IP  and the need for NAT (we will configure NAT later , but\nconcept starts here) .\n- Briefly overview IPv6 basics : understand the IPv6 address format, why IPv6 was introduced, and the\ndifferent address types (global, link-local, unique local, multicast) . We will do more IPv6 in Week\n4, but start familiarizing now.\nResources:\n- Videos/Tutorials:\n- “IPv4 Addressing Basics”  (Cisco Networking Academy YouTube, ~15 min) – Explains how IP addresses\nand subnet masks work, with examples.\n- NetworkChuck “Subnetting Masterclass”  (YouTube, ~30 min) – Chuck demonstrates a quick method\nto subnet, using his energetic style. He covers binary math in an accessible way.\n-  Jeremy’s  IT  Lab  Day  7  &  8  –  IPv4  Addressing  Part  1  &  2  (YouTube,  ~40  min  total)  –  In-depth\nsubnetting lectures , including practice problems (Jeremy breaks down the process step-by-step).\nHighly recommended – follow along and do the exercises he presents.\n- “IPv6 Basics”  by Sunny Classroom (YouTube, 20 min) – Simple explanation of IPv6 address notation,\ntypes, and how it differs from IPv4. A good intro before diving deeper next week.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 1)  – Read Chapter 11: IP Addressing  (covers IPv4 addressing and intro to\nsubnetting). Work through the examples in the chapter by hand. Then read Chapter 12:\nSubnetting  and do the practice problems  provided. Odom’s books have practice questions at\nchapter ends – ensure you attempt those.\n“31 Days Before Your CCNA”  (if available) – Day 5 and 6 cover IPv4 and subnetting in a concise\nway, with practice quizzes. This can be a quick refresher once you learn from Odom.\nComputer Networking (Kurose/Ross)  – Section 4.3 covers IP addressing and CIDR. It offers a\nconceptual view (skip heavy details on routing algorithms for now).\n(Reference) Subnetting Cheat Sheet  – find a reliable cheat sheet (like one on IPCisco or Cisco’s\nsite)  that lists common subnet sizes (/24, /25, /26, … /30) with their block size, number of\nhosts, etc. Keep this for reference initially, but aim to memorize key subnet values over time.\nResearch Papers/Articles:\nRFC 1918 – Address Allocation for Private Internets  – skim this to see the official private IP\nranges (10.0.0.0/8, 172.16/12, 192.168/16) and understand why/how they’re reserved.\n“Subnetting – Why and How”  (Cisco Blog or PacketLife article) – an article explaining real-world\nuse of subnetting (segmentation, reduced broadcast domains).\nCisco Press Article: “IPv6 Address Types”  – outlines global vs link-local vs unique local, etc., in a\nstraightforward manner . This complements the brief IPv6 intro from videos. 79\n1213\n8081\n•\n•\n•\n•\n•\n82\n•\n•\n•\n•\n8\n\n(Optional,  deep  dive) “IPv4  Address  Exhaustion  and  NAT”  –  any  networking  journal  article\ndiscussing how IPv4 exhaustion led to NAT and IPv6 (if curious about the bigger picture).\nOnline Courses:\nCisco NetAcad – ITN v7 Modules 8 & 9 : These modules cover IP addressing and subnetting with\ninteractive examples. Do the lab exercises like “Subnetting scenario” if provided. NetAcad also\nhas a Subnetting Game  in some courses – use it to practice in a fun way.\nUdemy Free Subnetting Course  (if any exist, or simply find a free worksheet online) – Some\ninstructors have free sections or practice sets for subnetting. Timed subnetting quizzes help\nbuild speed (e.g., “subnetting in your head” challenges).\nHands-On Labs/Projects:\nLab 3.1: Subnetting Practice (Paper or Tool)  – Not a typical lab, but spend time manually\ncalculating  subnets. For example, take a Class C network 192.168.10.0/24 and practice making:\n(a) 2 subnets (each /25), (b) 4 subnets (/26), (c) 8 subnets (/27). Write down the subnet ID,\nbroadcast, and valid host range for each. Do similar for a /16. Use a whiteboard or spreadsheet if\nneeded. Check answers with a subnet calculator to verify.\nLab 3.2: Configure Subnets in Packet Tracer  – Build a small network with 3 subnets : e.g., one\nfor Branch1 PCs, one for Branch2 PCs, and one for the WAN link between two routers. For\ninstance: Router A (Branch1) with PC network 192.168.1.0/24, Router B (Branch2) with PC\nnetwork 192.168.2.0/24, and a /30 for the link between routers. Configure IPs on two routers’\ninterfaces and on a PC in each subnet. Use static routes (we haven’t formally covered yet, but you\ncan guess or look up how to add a static route) to ensure the two PCs can ping each other\nthrough the routers. Expected Outcome:  Both PCs, in different IP networks, communicate via\nthe routers (verifying your addressing and basic routing config). This is a preview of Week 4’s\nrouting topics but reinforces addressing.\nLab 3.3: IPv6 Addressing Basics  – In Packet Tracer , enable IPv6 on a router and a PC: assign a\nglobal IPv6 address (e.g., 2001:DB8:1::1/64 on router , 2001:DB8:1::2/64 on PC) and a link-local\n(should auto-generate). Ping the link-local and global addresses to test connectivity. If unfamiliar\nwith IPv6 config, use a guide. Expected Outcome:  You can configure and verify IPv6 addressing\non Cisco IOS and understand the abbreviations. Document one example of an IPv6 address you\nused and identify its parts (network prefix, interface ID).\nQuizzes/Assessments:\nSubnetting Speed Quiz:  time yourself to find answers to 5 subnetting questions (e.g., “How\nmany hosts in a /27?”, “What is the subnet mask for 4 subnets of /24?”). Resources like\nsubnettingpractice.com or random question generators help. Aim to get each within 1-2 minutes\nwithout referring to notes.\nBoson ExSim (if available) Subnetting section  – Boson practice exams have great subnetting\nquestions. If you have access, try a subset. If not, use free question dumps carefully on\nExamTopics – focus on understanding, not memorizing answers.\nChapter-end questions from Odom  – do all at end of IP addressing chapters.\nContinue adding flashcards: e.g., “Subnet mask /26 = ? 255.255.255.192, hosts?”, “Private IP\nranges?”, “IPv6 link-local prefix?”. Daily review previous cards – by now ~30+ cards in deck.\nTime Allocation (~14 hours):\n- Concept videos: ~2 hours (more time should be on practice than videos now)•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n9\n\n- Reading & Note-taking: ~3 hours (addressing chapters, articles)\n- Subnetting practice (paper/calculations): ~3 hours (spread out in sessions)\n- Packet Tracer labs: ~4 hours (multi-subnet network, IPv6 config)\n- Quizzes & flashcards: ~2 hours (including timed practice)\nMilestones & Checkpoints:\n- Milestone 1:  Be able to subnet a network in under 10 minutes  for a given scenario. For example,\n“Design an IP scheme for a company with 3 departments (50 hosts, 30 hosts, 20 hosts). What subnets\ndo you use out of 192.168.10.0/24?” – Write out your solution and rationale.\n- Milestone 2:  Complete Lab 3.2 (2-router , 2-PC network) and demonstrate a successful ping from a PC\non Router A’s network to a PC on Router B’s network. This shows you can correctly assign IPs and even\nset a basic static route. Save this lab as “Week3_RoutingIntro.pt”.\n-  Milestone 3:  List the three private IPv4 ranges from memory and explain in a few sentences  why\nprivate addresses need NAT to reach the Internet. Similarly, list at least two types of IPv6 addresses\n(e.g., “Link-local starts with FE80, used only on local link”).\n- Checkpoint:  By end of Week 3, subnetting should feel more comfortable.  If you still struggle, schedule\nextra practice – it’s that important. Consider using a  subnetting app or game  daily for speed. Also\ncheck that you haven’t neglected earlier topics: try explaining to yourself how OSI layers relate now that\nyou’ve added IP (Layer3) knowledge.\nMotivation:  Subnetting is often a hurdle for beginners – if you’ve cracked it this week, give yourself a pat\non the back! If not, don’t panic; it  will click with continued practice. Many find it helpful to teach\nsomeone else (or an imaginary student) the process – this solidifies your mastery. You’re now halfway\nthrough  the  fundamentals  phase.  Keep  up  the  disciplined  study  habits.  Next  week  we’ll  wrap  up\nNetwork Fundamentals with more on IPv6, wireless, and some network services."
      },
      {
        "number": 4,
        "title": "Wrapping up Fundamentals (IPv6, Wireless, Visualization, Review)",
        "content": "Objectives (Week 4):\n- Solidify understanding of IPv6 : cover address types in more detail (global unicast, unique local, link-\nlocal, multicast, anycast) and IPv6 configuration on Cisco devices (SLAAC, DHCPv6 concepts).\n- Learn basic network troubleshooting tools : ping, traceroute , and OS commands to verify IP\nconfiguration ( ipconfig /ifconfig  on host OSes) . By CCNA blueprint, you should know how to\nverify IP parameters on Windows, Mac, Linux.\n- Explore wireless fundamentals : non-overlapping Wi-Fi channels (2.4GHz vs 5GHz), what an SSID is,\nbasics of Wi-Fi security (WPA2). This ties into Network Fundamentals (1.11 wireless principles) and\nSecurity Fundamentals (5.9 wireless security protocols) .\n- Introduction to network virtualization : concepts of VLAN (virtual LAN) vs VRF vs VPN (just definitions;\nwe will configure  VLANs in Month 2, but here understand that virtualization allows multiple networks on\nsame physical infrastructure). Also understand what a server virtualization  and container  means in\nnetworking contexts  (to meet 1.12 blueprint).\n- Conduct a  Month 1 review : revisit all main topics (devices, OSI, TCP/UDP, addressing). Identify any\nweak areas before moving to Month 2.\nResources:\n- Videos/Tutorials:\n- “IPv6 Address Types”  (KEITH Barker YouTube, ~20 min) – Keith (or similar instructor) explaining global\nvs local vs link-local addresses, multicast, and how IPv6 addresses auto-configure.\n- Jeremy’s IT Lab Day 31-33 – IPv6 Parts 1-3  (YouTube, ~30 min each) – These cover IPv6 addressing\nand configuration in detail. Perhaps focus on Day 31 (IPv6 basics) and Day 32 (configuring IPv6) for now,\nand we can revisit Day 33 later for advanced IPv6 routing concepts.83\n84\n85\n10\n\n- “Wireless Networking Basics”  (Cisco or CompTIA Network+ channel, ~15 min) – Introduction to Wi-Fi\nstandards (802.11), frequencies, channels, and security basics.\n- “Intro to VLANs”  (NetworkChuck, 10 min) – Though we’ll do VLANs next month, watch this short video\nto  conceptualize  network  segmentation  (it  reinforces  the  idea  of  virtualization  at  Layer2,  part  of\nblueprint 1.12).\n-  (Optional) “Basic  Troubleshooting  Tools”  (CBT  Nuggets  or  Professor  Messer ,  10  min)  –  A  quick\noverview of using ping, traceroute, etc., on different OSes.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 1)  – Read Chapter 13: IPv6 Addressing & Subnetting . Focus on the sections\nabout IPv6 address types and the configuration examples (don’t get bogged down in IPv6\nsubnetting – just know it conceptually, since CCNA may have a few IPv6 questions but not heavy\ncalculation).\nCert Guide Chapter 5: Network Protocols  (if not already covered) – Contains a section on ICMP\n(ping, traceroute) and basic DHCP/ARP concepts. This ties up some loose ends in fundamentals\n(knowing ARP as a link-layer address resolution, for example).\nCWNA (Certified Wireless Network Administrator) Study Guide  (if accessible) – skim the intro\nchapter on WLAN fundamentals to understand SSID, channels, and basic wireless security.\nAlternatively, any Cisco Press Wireless Fundamentals  chapter if available.\nVirtualization/Cloud  Basics:  A  short  chapter  or  whitepaper  on  virtualization  (e.g.,  “Intro  to\nVirtualization” by VMware or Cisco’s Network Virtualization whitepaper) – focus on the idea of\nrunning multiple logical networks on one physical set of devices (this concept underlies VLANs,\nVRFs, and SDN).\nResearch Papers/Articles:\nCisco Blog: “IPv6 – The Next Generation Internet”  – an article by Cisco explaining why IPv6 is\nimportant, with some real-world adoption info.\n“The TCP/IP vs OSI Debate”  – historical perspective article on why both models exist. (Good\nread to wrap up your understanding of models.)\nCisco Whitepaper: “Networking in Virtualized Environments”  – describes challenges and\nsolutions when multiple VMs share a host (introduces virtual switches, etc.). Just read the\noverview to fulfill blueprint 1.12 context.\nOSI Model Quiz/Chart  – one more glance at a reference (StationX OSI cheat sheet  or similar)\nto ensure you can mentally map all layers after learning these services (e.g., know that ping uses\nICMP at Layer3, traceroute also uses Layer3, etc.).\nOnline Courses:\nCisco NetAcad – Module 10 (IPv6 Addressing) : Go through this module, which includes\nactivities on configuring IPv6 addresses and maybe an IPv6 Packet Tracer exercise.\nCisco NetAcad – Module 17 (Network Troubleshooting) : This might be in the later part of the\ncourse; if accessible, check out the portion on using ping and traceroute effectively.\nLabs from previous weeks : Consider redoing any NetAcad Packet Tracer labs now without\nlooking at instructions, as a self-test.\nHands-On Labs/Projects:•\n•\n•\n•\n•\n•\n•\n•\n•\n• 86\n•\n•\n•\n•\n•\n11\n\nLab 4.1: IPv6 Neighbor Discovery  – Extend Lab 3.3 (the IPv6 lab). Configure two routers\nconnected via IPv6. Enable OSPFv3 or simply static routes for IPv6 to see end-to-end connectivity.\nAlso, test the SLAAC  feature: on a router interface, enable it to advertise a prefix (turn on IPv6\nunicast-routing and use ipv6 address prefix/64 eui-64  on interface, or SLAAC configs).\nConfigure a PC to get an IPv6 address automatically. Expected Outcome:  The PC autoconfigures\na global IPv6 address (stateless) and can reach the router . Check the PC’s IPv6 config to see link-\nlocal and autoconfigured addresses.\nLab 4.2: Wireless Router in Packet Tracer  – PT has generic wireless routers. Set up a PT home\nwireless router , give it an SSID “Week4WiFi” with WPA2 password, and add a PC with a PT wireless\nNIC to connect to it. See if you can ping between wireless PC and a wired PC on that router .\nExpected Outcome:  Understand how a wireless client associates via SSID/security to an AP. (This\nlab is limited but gives a conceptual demo. Real gear would be needed for full effect, but PT can\nsimulate a bit.)\nLab 4.3: Basic Troubleshooting Scenarios  – Deliberately break things in a small PT network and\npractice troubleshooting: e.g., take a simple two-router network and misconfigure IP on one\nside, or use wrong default gateway on a PC, then use ping and traceroute  from the\ndevices to identify the issue. Document one scenario: describe the symptoms (e.g., PC1 can’t\nreach PC2), your troubleshooting steps (ping X, got no reply, etc.), the identified problem, and\nthe fix.\n(Project) Fundamentals Summary Mind-Map:  As a wrap-up for Month 1, create a visual mind-\nmap or diagram that connects the concepts learned: Show how OSI layers relate to specific\nprotocols (HTTP at Layer7, TCP at Layer4, IP at Layer3, Ethernet at Layer2), list device types and\nwhere they operate, illustrate an IPv4 vs IPv6 address example, and indicate how subnetting\nbreaks a network. Making this map will reinforce the holistic view.\nQuizzes/Assessments:\nEnd-of-Month Fundamentals Exam:  Take a comprehensive practice test on all topics covered in\nMonth 1 (maybe 50 questions). You can use a mix of resources: some questions from ExamTopics\n(filter by fundamentals), some from Odom’s end-of-part quizzes, or a free online CCNA\nfundamentals test. Treat it like a real exam: timed 60 minutes for 50 questions.\nBoson ExSim lite : If you have Boson, perhaps attempt a subset of one exam focusing on early-\ndomain questions.\nSkill drill : Perform a “Layer-by-Layer” drill – for a given scenario (like loading a webpage),\nverbally walk through each OSI layer and what happens. This isn’t a formal quiz but a cognitive\nexercise to test integrated understanding. Possibly do this with a friend or mentor if available, or\nrecord yourself.\nTime Allocation (~12 hours):\n- Videos: ~2 hours (IPv6 and wireless intros)\n- Reading: ~2 hours (IPv6 chapter , wireless section, virtualization article)\n- Labs: ~5 hours (IPv6 configs, wireless PT, troubleshooting practice)\n- Review & Quizzes: ~3 hours (including the 50-question test and analysis of answers, plus assembling\nthe mind-map project)\nMilestones & Checkpoints:\n- Milestone 1:  Configure IPv6 on two routers and two PCs (as in Lab 4.1) so that all devices can ping\neach other’s IPv6 global addresses. This confirms understanding of IPv6 addressing and basic routing.\nSave lab “Week4_IPv6.pt”.\n- Milestone 2:  Write a short explanation of a real-world scenario using each wireless security protocol•\n•\n•\n•\n•\n•\n•\n•\n12\n\n(e.g., “WPA2 is currently common for home Wi-Fi, WPA3 is newer and more secure, WEP is obsolete”).\nAlso list 3 non-overlapping channels in 2.4GHz (1, 6, 11) to demonstrate wireless basics knowledge.\n- Milestone 3:  Complete the Month 1 practice exam (50 Qs) with a score of ~80% or higher . Review each\nwrong answer and write down why the correct answer is correct. If score < 80%, identify weak areas and\nplan a revision in Week 5 (we can allocate some review time then).\n- Checkpoint: Fundamentals phase complete!  You should now be confident in network foundational\nconcepts. Verify that you have: a solid grasp of IP addressing and can do subnetting relatively quickly;\nfamiliarity with the CLI; understanding of how different network components function and interact. Any\nlingering confusion here should be addressed before moving on, as Months 2–4 will build on this\nfoundation. Don’t hesitate to use community forums or study groups to clarify doubts.\nMotivation:  Month 1 down – awesome job. Many newcomers falter at the abstract concepts stage, but\nyou’ve persevered. Now you have a base to build on. Take a moment to reflect on how much you’ve\nlearned in just four weeks. Networking might still feel vast (it is), but piece by piece, you are conquering\nit. Stay curious and stay disciplined.  Next month, we’ll start configuring networks in earnest (VLANs,\nrouting, etc.), which is where the fun really begins because you’ll make things  work ! Enjoy a well-\ndeserved rest day before Month 2, and maybe reward yourself (you’ve earned it!)."
      }
    ]
  },
  {
    "number": 2,
    "title": "Network Access and Switching Essentials (Fundamentals Part III + Intro to Network Access)",
    "focus": "Month 2 transitions from pure theory into more hands-on switching and network access topics. We’ll cover the CCNA Network Access domain (VLANs, STP, EtherChannel, wireless LANs in more depth) and finish any remaining fundamentals (like ARP, DHCP basics) as they tie in. By the end of Month 2, you’ll have configured VLANs, understood how switches prevent loops with STP, and set up a basic wireless LAN. We’ll also continue practicing subnetting and introduce more troubleshooting and design thinking. Domains covered: Network Access (CCNA domain 2.0) in-depth, plus relevant IP Services basics (DHCP, ARP) and revisit Network Fundamentals concepts in practice.",
    "weeks": [
      {
        "number": 5,
        "title": "VLANs and Inter-VLAN Routing",
        "content": "Objectives (Week 5):\n- Understand VLAN concepts : what VLANs are, how they provide network segmentation at Layer 2, and\ndefault VLAN behavior .\n- Learn to  configure VLANs  on Cisco switches: create VLANs, assign switch ports to VLANs (access\nports) , understand the concept of the management VLAN  and native VLAN.\n- Implement  Inter-VLAN routing : since different VLANs are different subnets, you need a router or\nLayer 3 switch to route between them. We’ll configure Router-on-a-Stick  (a router with subinterfaces\nfor each VLAN) to enable devices in different VLANs to communicate.\n- Practice troubleshooting VLAN issues : e.g., mismatched VLANs, incorrect IP addressing for VLANs.\n- Reinforce subnetting with a real config: design IP subnets for each VLAN in a network and apply them.\nResources:\n- Videos/Tutorials:\n- “VLANs Explained”  by Kevin Wallace (YouTube, 20 min) – Great conceptual intro to VLANs, why we use\nthem, with simple diagrams.\n- Jeremy’s IT Lab Day 12 – VLANs  (YouTube, ~30 min) – Goes into normal-range VLAN config, access\nports, verifying VLANs on a switch, etc.\n-  NetworkChuck “Router on a Stick”  (YouTube, 15 min) – Demonstrates inter-VLAN routing using a\nrouter with subinterfaces, with a bit of fun flair . This helps visualize how one router interface can handle87\n15\n13\n\nmultiple VLANs via trunk.\n- CBT Nuggets “Inter-VLAN Routing”  (if you have access, ~15 min) – shows configuration on a Layer 3\nswitch as well as router-on-a-stick. If no CBT, look for another free video on inter-VLAN routing (e.g.,\nDavid Bombal has some).\nBooks/Chapters:\nCCNA Cert Guide (Vol. 1)  – Read Chapter 10: LAN Switching Fundamentals  and Chapter 11 (if\npresent in Vol1) or relevant sections on VLANs and trunking. Pay attention to commands like\nswitchport mode access , switchport access vlan X , vlan database  vs VLAN\nconfig mode (depending on IOS). Also read the part on 802.1Q trunking  – what it is and how the\nnative VLAN works .\nOfficial Cert Guide (Vol. 2)  – If Vol.2 covers Inter-VLAN routing, read that chapter (likely early in\nVol2). It will explain router-on-a-stick configuration and multilayer switching.\n“CCNA 200-301 Network Access” (Odom’s condensed notes)  – If available, Cisco Press often\nhas an exam review guide summarizing VLAN and STP topics. Use it to review key points after\nlearning.\nLab manual:  “31 Days Before CCNA”  – see if there’s a day on VLANs or trunking and do the\nexercises.\nResearch Papers/Articles:\nCisco Document: “Configuring VLANs”  – official Cisco docs on VLAN config (on Catalyst\nswitches). Skim for any best practices (like naming VLANs, using VLAN 1 or not, etc.).\n“The Death of VLAN 1”  (blog) – an article explaining why you should not use VLAN 1 for\nmanagement (common security advice). This adds real-world flavor to your VLAN knowledge.\nCisco Support Forum thread on Router-on-a-Stick  – read a Q&A or troubleshooting case to see\ncommon mistakes (e.g., forgetting to set the router port as trunk or mismatched native VLAN).\n(Design) “LAN  Segmentation  and  VLANs”  –  chapter  from  an  older  Cisco  design  guide  or\nwhitepaper explaining how VLANs are used in network design. Focus on the rationale (security,\nreduce broadcasts, etc.).\nOnline Courses:\nCisco NetAcad – Switching, Routing & Wireless Essentials (SRWE) v7 : If you finished ITN, the\nsecond course SRWE covers VLANs early on. Complete Chapter 2: VLANs, and Chapter 3: Inter-\nVLAN Routing. There will be Packet Tracer labs for both (do them!).\nLabs from Packet Tracer Tutorials  – Cisco PT has some built-in sample labs (check “Open\nSample” in PT). Look for any labeled VLAN or trunking to practice.\nUdemy (optional)  – If you find a cheap CCNA lab course, you can do a VLAN lab with them; but\nlikely your own practice is enough.\nHands-On Labs/Projects:\nLab 5.1: VLAN Configuration and Ping Test  – In Packet Tracer , set up one switch with 3 PCs on\nit. Create 2 VLANs (say VLAN10 and VLAN20). Put 2 PCs on VLAN10, and 1 PC on VLAN20. Assign\nIP addresses such that PCs in different VLANs are on different subnets (e.g., VLAN10 uses\n192.168.10.0/24, VLAN20 uses 192.168.20.0/24). Initially, do not configure any router . Verify that•\n•\n16\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n14\n\ntwo PCs in the same VLAN can ping each other (should work), but PCs in different VLANs cannot\n(expected, since no inter-VLAN routing yet). This shows VLAN segmentation.\nLab 5.2: Router-on-a-Stick  – Extend Lab 5.1 by adding a Router (2911 or similar in PT) and\nconnecting the switch to the router with one link. Configure that switch port as a trunk\n(switchport mode trunk ) and on the router configure subinterfaces: e.g. Gig0/0.10  for\nVLAN10, Gig0/0.20  for VLAN20, assign 192.168.10.1 and 192.168.20.1 respectively. Don’t\nforget encapsulation dot1Q 10  etc. Now set each PC’s default gateway to the router’s\nsubinterface IP (PCs in VLAN10 use 192.168.10.1). Expected Outcome:  PCs in different VLANs\ncan now ping each other through the router . Also test pinging the router gateways. Save this lab\nas “Week5_VLAN_RouterOnStick.pt”.\nLab 5.3: Trunking and Native VLAN  – Add a second switch to Lab 5.2, connected via a trunk link\nto the first switch. Put one PC on the second switch on VLAN10. Ensure trunk is up (use show\ninterfaces trunk ). The PC on switch2 VLAN10 should communicate with PCs on switch1\nVLAN10. Experiment by changing native VLAN on one side and see the effect (noticing errors or\nping issues if mismatched). Then set them correctly. Expected Outcome:  Understanding of how\ntrunks carry multiple VLANs and the importance of matching native VLANs.\n(Mini-Project) VLAN Design Document:  Imagine a small office network for a company with 3\ndepartments (e.g., Sales, Engineering, Guest WiFi). Sketch a simple network diagram showing 3\nVLANs, how they connect to a router or L3 switch for inter-VLAN routing, and propose an IP\nrange for each. Write a paragraph justifying the VLAN segmentation (e.g., “to isolate guest traffic\nfrom internal”, etc.). This is a design exercise to apply VLAN knowledge conceptually.\nQuizzes/Assessments:\nVLAN/Trunking Quiz:  ~15 questions focused on VLAN concepts. E.g., “What command assigns a\nport to VLAN 10?”, “Which VLAN ID range is normal vs extended?”, “What is the purpose of the\nnative VLAN?”, “True/False: Devices in different VLANs can communicate without a router .” Use\nCCNA exam prep question banks or the NetAcad chapter quiz.\nInter-VLAN routing quiz:  ~10 questions on router-on-a-stick config (e.g., identify missing config\nin a scenario, or understand subinterface numbering).\nReview past topics:  include 5 mixed questions from Month 1 topics (to keep memory fresh).\nFlashcards: add key VLAN-related commands and concepts (e.g., “Default VLAN = ? (VLAN1)”,\n“802.1Q tag adds how many bytes? (4 bytes)”, “Router-on-a-stick requires what encapsulation\ncommand?”, etc.).\nTime Allocation (~13 hours):\n- Videos: ~2 hours (VLAN + inter-VLAN demos)\n- Reading: ~2 hours (Cert Guide + articles)\n- Labs/Practical: ~6 hours (it will take time to configure, test, troubleshoot VLAN labs, especially trunking\nwith multiple switches)\n- Quizzes & flashcards: ~2 hours\n- Note consolidation: ~1 hour (documenting lab results, updating your notes with configurations done\nand lessons learned)\nMilestones & Checkpoints:\n- Milestone 1:  Successfully implement a router-on-a-stick with at least 2 VLANs and verify connectivity\nbetween  VLANs via the router . Confirm by screenshotting ping tests from a PC in VLAN10 to a PC in\nVLAN20, along with a show ip interface brief  on the router showing subinterfaces up.\n- Milestone 2:  Describe in your notes the difference between an Access Port  and a Trunk Port . List the\ncommands to configure each. Also note the typical native VLAN (default 1) and how to change it.•\n•\n•\n•\n•\n•\n•\n•\n15\n\n- Milestone 3:  Score 80%+ on the VLAN/Inter-VLAN quizzes. If any VLAN concept is wrong (for example,\nconfusion about extended VLAN range or how trunk tagging works), revisit that portion in Odom or\nvideos until clear .\n- Checkpoint:  You’ve now done substantial switch configuration. Ensure you can confidently navigate\nshow vlan , show interfaces trunk , and understand what it means. If possible, discuss with a\npeer or in a forum one of your labs (explaining what you did helps cement knowledge). Heading into\nWeek 6, we’ll tackle Spanning Tree and EtherChannel, which build on the VLAN/trunk knowledge. Make\nsure trunking is solid in your mind (we’ll see why STP is needed when redundancy is introduced).\nMotivation:  Setting up VLANs is your first real network engineering  task – you segmented a network and\nmade them talk. This is exactly what network engineers do in enterprises. Reflect on how far you’ve\ncome from “what is a network” to actually configuring multi-VLAN networks! The first time is always the\nhardest; it gets easier . If things didn’t work initially, that’s normal – troubleshooting and figuring out why\n(maybe a missing encapsulation  command or mis-assigned port) is where real learning happens.\nEmbrace those moments. Keep this momentum into Week 6."
      },
      {
        "number": 6,
        "title": "Spanning Tree and EtherChannel (Switch Resiliency)",
        "content": "Objectives (Week 6):\n- Understand the Spanning Tree Protocol (STP) : why it exists (prevent switching loops), how it elects a\nroot bridge and manages port states (forwarding/blocking) . Learn the basics of Rapid PVST+\n(the Cisco default spanning tree mode) and terms like Root Port, Designated Port, Blocking/Alternate Port\n.\n- Configure STP settings on switches: not in-depth (CCNA is limited here), but know how to identify the\nroot bridge ( show spanning-tree  output) and adjust priorities to influence root election, if required.\n-  Learn  about  EtherChannel  (Link  Aggregation) :  purpose  (increase  bandwidth  and  provide\nredundancy by bundling links) . Understand the protocols LACP (open standard) vs PAgP (Cisco\nproprietary) for negotiating EtherChannels.\n-  Configure  a  simple  EtherChannel  between  two  switches  in  Packet  Tracer  using  LACP  (since  PT\nsupports it). Verify with show etherchannel summary .\n- Continue  wireless and security fundamentals : If not covered yet, ensure understanding of how\nenterprise wireless differs (AP & WLC architectures, which we’ll touch in Week 7) and how spanning tree\nand EtherChannel might interplay with Wi-Fi (mostly separate topics but complete the network access\ndomain fully).\n- Integrate knowledge with a larger lab: by now, you know VLANs, routing, STP, EtherChannel – attempt\na lab combining these (see Hands-On).\nResources:\n- Videos/Tutorials:\n- “Spanning Tree Protocol Basics”  by Keith Barker (YouTube, 30 min) – Keith often uses animations to\nshow how STP elects root and blocks certain ports to break loops. This is valuable to visualize the\nprocess.\n- Jeremy’s IT Lab Day 13 – Spanning Tree  (YouTube, ~20 min) – Focuses on the need for STP and basics\nof port roles/states. Jeremy keeps CCNA STP coverage straightforward.\n- NetworkChuck “Spanning Tree in 5 Minutes”  (YouTube, 5 min) – a high-level quick recap of STP (for a\nbit of fun revision).\n-  “EtherChannel Explained”  by David Bombal (YouTube, 15 min) – Shows EtherChannel config and\nverification, plus common mistakes (like ports not matching settings).1920\n88\n18\n16\n\n-  CBT  Nuggets  “EtherChannel”  (if  access,  10  min)  –  Another  demonstration,  perhaps  using  real\nequipment. If not, the free Bombal video suffices.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 1 or 2)  – Find the section on Spanning Tree Protocol (likely in Vol.2 under\nLAN switching). Read the parts about STP operations , RSTP improvements , and the CCNA-level\ndetail of PVST+ (per-VLAN STP). Note: memorize STP port states (Blocking, Listening, Learning,\nForwarding, Disabled) and port roles (Root, Designated, Alternate) – Odom’s text will cover these\nclearly.\nAlso read about Layer 2 EtherChannel  in the Cert Guide. Focus on configuration guidelines (all\nmember ports must have same speed/duplex, be in same VLAN or trunk mode, etc.) and LACP\nmodes ( active/passive ).\n“Spanning Tree Protocol” (Cisco Press Chapter)  – if you have a CCNA or CCNP Switching book,\none chapter on STP will reinforce your understanding. Pay attention to how BPDU (Bridge\nProtocol Data Units) are used to elect the root and settle port roles.\nErrata or recent updates:  Check if any CCNA update added topics like BPDU Guard  or PortFast\nbasics (these are mentioned in blueprint: PortFast benefits ). If so, read about those features\n(PortFast allows edge ports to skip STP listening/learning, BPDU Guard disables a PortFast port if\nunexpected BPDUs seen – important for security).\nResearch Papers/Articles:\nIEEE 802.1D spec (overview)  – not suggesting to read the standard, but maybe find a summary\narticle about how the 802.1D Spanning Tree algorithm works. Good for conceptual clarity if\ninterested.\nCisco Whitepaper: “Understanding Rapid Spanning Tree (802.1w)”  – an article or doc\nexplaining how RSTP achieves faster convergence than traditional STP. Only read the intro and\nmaybe the part about how port roles differ (alternate/discarding vs blocking).\nNetworking Forum discussions  – find a Q&A on something like “Why did my EtherChannel not\nform?” or “STP blocking port on redundant link – is it working correctly?” to see real-world\napplication of these concepts.\nEtherChannel vs STP design  – a blog that explains how EtherChannel can be used to prevent\nSTP from needing to block ports (because from STP’s perspective, an EtherChannel is one logical\nlink). This is more design-oriented but enriches understanding.\nOnline Courses:\nCisco NetAcad – SRWE v7 Module 4: STP  and Module 5: EtherChannel. Go through these\nchapters, do the Packet Tracer activities such as “4.6.6 Packet Tracer – Investigate STP” (if\navailable) where you can see STP in action, and “5.x.x Packet Tracer – Configure EtherChannel”.\nThese labs align perfectly with our objectives.\nLab challenges : Some online resources have “challenge labs” for CCNA (like showing a network\ndiagram and asking you to configure STP priorities, etc.). If you find one, try it out.\nPractice exam on L2 : If your study resources have topic-wise exams, take one on “Network\nAccess” at the end of this week to gauge your progress on switching topics.\nHands-On Labs/Projects:•\n•\n•\n•\n•\n89\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n17\n\nLab 6.1: Spanning Tree Exploration  – Use your Lab 5.3 topology (two switches connected by\ntwo links? If not, create a scenario with 2 switches and 2 redundant links between them, plus a\ncouple PCs). By default STP will block one link. Use show spanning-tree  on each switch to\nidentify the root bridge, root ports, and blocked port. Task:  Change the bridge priority on one\nswitch to make it the root for VLAN1 deliberately (e.g., spanning-tree vlan 1 priority\n4096). Observe how STP reconverges and which ports are now forwarding/blocking. Also test\nPortFast: set one of the PC access ports as PortFast ( spanning-tree portfast  on Cisco). The\nPC’s port should go into forwarding immediately on link up (in PT this might be hard to notice,\nbut conceptually note it). Expected Outcome:  You can interpret STP status and influence root\nelection. Document which switch became root and which port got blocked and why.\nLab 6.2: Configure EtherChannel (LACP)  – Take two switches with 4 connections between them\n(or add additional links to an existing topology). Before EtherChannel, STP would block all but\none. Now configure EtherChannel: e.g. on both switches do interface range f0/1-2 ,\nchannel-group 1 mode active  (LACP active). Do same for f0/1-2 on the other switch (active\nor passive mode). This should form an EtherChannel bundling two ports. Verify with show\netherchannel summary . Ensure you assign the EtherChannel (Port-channel1) as trunk or\naccess appropriately. Expected Outcome:  The EtherChannel comes up (flags “SU” in summary)\nand STP now sees it as a single link, preventing loops while both physical links carry traffic. Test\nby sending pings while bringing down one member link to see traffic continues.\nLab 6.3: Integrated Network Challenge  – Design a scenario that uses everything from"
      }
    ]
  },
  {
    "number": 3,
    "title": "Routing & IP Connectivity (Core Routing Protocols and Services)",
    "focus": "Month 3 dives into the IP Connectivity domain (25%) – configuring and understanding routing. We will cover static routing and the OSPF routing protocol in detail, as well as first-hop redundancy protocols conceptually. We’ll integrate IP Services like DHCP, NAT, and NTP as we set up networks that need those services. By the end of Month 3, you will have built multi-router topologies, configured• • 19 dynamic routing with OSPF, and implemented common IP services in labs. Domains covered: Primarily IP Connectivity (CCNA 3.0) and parts of IP Services (CCNA 4.0) like DHCP, NTP as needed in labs.",
    "weeks": [
      {
        "number": 7,
        "title": "Static Routing and Redundant Default Gateways",
        "content": "Objectives (Week 7):\n- Learn how routers  forward packets  by default: refresh longest-prefix-match routing logic  and\nadministrative distance basics.\n- Configure static routes  on Cisco routers: host routes, network routes, default routes (quad-zero)\n. Understand when to use static routing (small or stub networks) and its limitations.\n-  Practice  troubleshooting  routing  issues:  e.g.,  missing  static  route  or  wrong  next-hop  causing  no\nconnectivity.\n- Introduce  First-Hop Redundancy Protocols (FHRP)  concepts: HSRP/VRRP/GLBP (the exam expects\nyou to know what they are and purpose , but not to configure them). Understand that they provide a\nvirtual gateway IP  so that if one router fails, another takes over – ensuring default gateway availability.\n- Implement a simple HSRP or VRRP scenario in Packet Tracer if possible (PT supports basic HSRP\nconfiguration on routers). This is to visualize how two routers can share an IP for redundancy.\n- Revisit ARP  and how it works in routing: ensure understanding that when a router forwards to next-\nhop, it uses ARP to get the MAC. This ties back to fundamentals and helps troubleshoot layer 3 vs layer\n2 issues.\nResources:\n- Videos/Tutorials:\n-  Jeremy’s IT Lab Day 11 – Routing Fundamentals & Static Routing  (YouTube, ~30 min)  –\nExcellent coverage on how routing tables work and step-by-step static route configuration.\n- NetworkChuck “Subnetting & Routing”  or similar (YouTube, ~10 min) – Some quick video showing\nhow packets get routed between subnets, reinforcing the concept we experienced in labs.\n-  Cisco CCNA Gold Labs – Static Routes  (if available on YouTube, e.g., a lab walkthrough by David\nBombal or Chris Bryant). Visualizing multiple routers and static routes can help.\n-  “FHRPs (HSRP vs VRRP vs GLBP)”  by Kevin Wallace (YouTube, ~15 min) – Explains the difference\nbetween these redundancy protocols and basic operation (active/standby, etc.).\n- (Optional) “Floating Static Routes”  (Keith Barker , 5 min) – Very short explanation of a static route with\nhigher administrative distance to serve as backup (ties into FHRP concept by achieving similar backup\neffect at routing level).\nBooks/Chapters:\nCCNA Cert Guide (Vol. 2)  – Read the chapter on IP Routing (should cover static routing and intro\nto dynamic routing). Focus on how to configure static routes ( ip route  command variants).\nThere's likely a section on first-hop redundancy in the IP Services part – read that to know\ndefinitions of HSRP/VRRP/GLBP (they might not require configuration, but Odom will describe\nhow HSRP works with virtual MAC, etc.).\nCert Guide on IP troubleshooting  – If there’s a chapter about troubleshooting routing, glean\ntips like using ping and traceroute  to find where connectivity stops, and checking routing\ntables.\nHSRP Configuration Guide (Cisco)  – Skim for context: just see sample config and how routers\nform active/standby. Not needed to memorize, but helpful if you attempt the optional lab.\nResearch Papers/Articles:25\n26\n91\n30\n9293\n•\n•\n•\n•\n•\n20\n\nCisco: “Introduction to Routing”  – a beginner-friendly article on how routers route. Could be on\nCisco Learning Network.\nRFC 5798 (VRRP)  – not to read fully, but maybe the intro and motivation for VRRP (open standard\nalternative to Cisco’s HSRP).\nNetwork Computing: “FHRP Comparison”  – an article or blog comparing HSRP, VRRP, GLBP in\nterms of what they do. Since GLBP (load balancing gateway) is Cisco-proprietary and interesting,\nnote how it differs.\nTroubleshooting Static Routes  – A support forum or blog scenario where static routes were\nmisconfigured (e.g., wrong next-hop, missing route on one side, etc.), and how it was diagnosed.\nThis  will  give  insight  into  common  pitfalls  (like  forgetting  a  route  back  causing  one-way\ncommunication).\nOnline Courses:\nCisco NetAcad – SRWE Module 6: Static Routing  and Module 15 (or ENAUTO content) on FHRP\n(if any). NetAcad has a lab “Configure Static Routing” – do it. Also, they might have a Packet\nTracer for HSRP. If yes, try it.\nLab Practice  – Some websites (like Free CCNA Workbook) have static routing labs. Use those\ndescriptions to set up scenarios.\nPacket Tracer Challenge  – Use PT’s Activity Wizard or find some PT activities shared online for\nstatic routing challenges (like a troubleshooting scenario where you must add missing routes).\nHands-On Labs/Projects:\nLab 7.1: Static Routing Basic  – Create a topology of 3 routers in a chain (R1—R2—R3) with three\nnetworks: network A between R1 and R2, network B between R2 and R3, and a loopback or LAN\noff R1 and R3 each to simulate end networks. Without dynamic routing, configure static routes\nso that: R1 knows how to reach R3’s LAN, R3 knows how to reach R1’s LAN, and both use R2 as\nnext hop. Also R2 needs routes to both LANs (or use default routes strategically). Expected\nOutcome:  End devices on R1’s LAN can ping end devices on R3’s LAN. Test by pinging across and\npossibly traceroute to see the path. Document the routing table of each router ( show ip\nroute output) to confirm the routes.\nLab 7.2: Static Route Failover (Floating Static)  – Modify Lab 7.1 by adding a redundant link:\ne.g., a direct link between R1 and R3 (so we have two paths between R1 and R3: one via R2, one\ndirect). On R1, set a primary static route to R3’s LAN via R2. Then set a floating static  (higher AD)\nvia the direct link. Do the inverse on R3. Test: when everything up, traffic goes via R2 (check\ntraceroute). Shut down the R1-R2 interface to simulate failure; traffic should reroute via direct\nR1-R3 link thanks to the floating static. Expected Outcome:  You see failover in action with static\nroutes (this parallels what dynamic routing or FHRP would do automatically). This solidifies\nunderstanding of AD (administrative distance) and backup routes.\nLab 7.3: HSRP Configuration  (optional if time and interest) – If Packet Tracer supports HSRP on\nrouters (it does on multilayer switches for sure, routers maybe), set up two routers both\nconnected to a LAN (e.g., PC, Switch, and two routers all in VLAN 10). Configure HSRP on the\nrouters for that VLAN10 network: give them a virtual IP as default gateway for the PC. Make one\nrouter active with higher priority. Observe that the PC’s default gateway is the virtual IP, but it’s\nbeing served by Router1. Then shut Router1’s interface and see Router2 take over (PC should still\nping out, perhaps to a simulated internet cloud or another network). Expected Outcome:  The\nPC doesn’t lose connectivity when the primary gateway router goes down – HSRP provides\nredundancy. Use show standby  on routers to see HSRP status. •\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n21\n\nLab 7.4: Troubleshoot Static Routes  – Intentionally break something in a static route setup:\ne.g., omit a route on one of the routers and see how ping fails one direction. Practice diagnosing:\nuse ping, then traceroute , then check routing tables, then fix route. Document this\nprocess as if writing a troubleshooting ticket resolution.\n(Design Exercise) Default Gateway Redundancy Plan:  Write a small memo for a hypothetical\nnetwork: two edge routers serving a network. Propose which FHRP to use (say VRRP if multi-\nvendor or HSRP if Cisco-only) and why. Outline the config steps at high level. This isn’t execution\nbut demonstrates you understand the problem FHRPs solve and how you’d apply it.\nQuizzes/Assessments:\nStatic Routing Quiz:  ~10 questions: covering syntax ( ip route  command format), how to\ninterpret a routing table entry, the effect of AD, and maybe a simple scenario question (“PC can’t\nreach server , which static route is missing?”).\nFHRP Quiz:  ~5 questions: mostly conceptual – “What does HSRP provide?”, “Which FHRP is Cisco-\nproprietary vs open?”, “How does a host use HSRP – what IP does it have as gateway?”, etc.\nSubnetting/IP review:  Include a few questions to keep subnetting fresh (never stop practicing!).\ne.g., “Which of these is a valid /30 network address?” or “You need at least 100 hosts, which mask\ndo you choose?”\nNetAcad Chapter quiz  for static routing (if using NetAcad).\nContinue Anki: static vs dynamic routing definitions, HSRP default port (maybe not needed, but\ncould note HSRP uses virtual MAC starting with 0000.0C07.ACxx – trivia that might appear),\ncommand for floating static route (just adding AD at end), etc.\nTime Allocation (~12 hours):\n- Videos: ~2 hours (routing fundamentals, FHRP)\n- Reading: ~2 hours (Cert guide static route chapter , FHRP sections)\n- Labs: ~6 hours (static route labs, including failover scenario and possibly HSRP)\n- Quizzes/Flashcards: ~2 hours (analysis of mistakes, reviewing tricky parts like VLSM or static route\nrecursion if any)\nMilestones & Checkpoints:\n-  Milestone  1:  Configure  static  routes  on  a  multi-router  topology  and  demonstrate  end-to-end\nconnectivity. Provide a screenshot of  show ip route  from each router with explanations of each\nroute entry (e.g., “S 10.1.1.0/24 [1/0] via 10.2.0.2” means a static route to network 10.1.1.0 with AD 1 via\nnext-hop 10.2.0.2). Explaining the routing table cements your understanding.\n- Milestone 2:  Achieve a successful static route failover test (if attempted): demonstrate via traceroute\nor ping that traffic reroutes when primary path is down. This shows grasp of AD and backup routes.\n- Milestone 3:  Be able to describe how HSRP/VRRP works without notes. For example: “HSRP: two or\nmore routers form a group with a virtual IP; one is active (forwarding) with virtual MAC, another is\nstandby; if active fails, standby takes over virtual IP/MAC so hosts don’t notice.” If you can say that,\nyou’re set for CCNA-level FHRP knowledge.\n- Milestone 4:  Static routing quiz score ~100% (it’s a small topic, aim to perfect it), FHRP quiz ~80%. If\nany confusion remains (like difference between GLBP vs HSRP), clarify now.\n- Checkpoint:  You’ve laid the groundwork for dynamic routing. Static routes are fine but imagine doing\nthat for 50 routers – not scalable. You should be eagerly anticipating how a protocol like OSPF will\nautomate route distribution – that’s next week. Also ensure you haven’t lost touch with switching:\nmaybe in labs you combined VLANs with routing (router on stick is static route case). If not, maybe\nquickly review your inter-VLAN lab to see static routes in action (the router had connected routes for•\n•\n•\n•\n•\n•\n•\n•\n22\n\nVLANs; static routes might have been used on switches if L3 switch, etc.). Everything’s building up. On to\nOSPF!"
      },
      {
        "number": 8,
        "title": "OSPF – Single-Area Configuration and Theory",
        "content": "Objectives (Week 8):\n- Learn what  OSPF (Open Shortest Path First)  is and why dynamic routing protocols are needed.\nUnderstand  OSPF’s  general  characteristics:  link-state  protocol,  uses  Dijkstra’s  algorithm,  forms\nadjacencies with neighbors, floods LSAs.\n- Know OSPF terminology:  Router ID ,  Area  (focus on single-area OSPF, typically Area 0 only in CCNA\nscope), DR/BDR  on multiaccess networks like Ethernet , metric  (cost, based on bandwidth).\n-  Configure  single-area  OSPFv2  on  Cisco  routers :  using  router ospf <process-id>  and\nnetwork  statements, or interface ip ospf  method. Practice a basic OSPF setup on a multi-router\ntopology and verify adjacency formation ( show ip ospf neighbor ) and routes ( show ip route\nshowing OSPF routes).\n- Handle OSPF attributes: set the Router ID manually (and know auto-selection rules), observe that OSPF\nchooses a DR/BDR on broadcast networks (maybe simulate with 3 routers in one LAN).\n- Basic OSPF troubleshooting: e.g., mismatched subnet masks or areas causing no adjacency.\n- Cover OSPF for IPv6 (OSPFv3) conceptually – CCNA may not heavily test it, but know that OSPFv3 exists\nand is similar but separate process for IPv6. If time, configure one OSPFv3 instance for practice.\n- Emphasize that OSPF is a key CCNA topic – possibly multiple exam questions, so spend ample time to\nmaster fundamentals.\nResources:\n- Videos/Tutorials:\n- Jeremy’s IT Lab Day 14 & 15 – OSPF (Parts 1 & 2)  (YouTube, ~30 min each) – These cover OSPF basics,\nconfiguration, neighbor relationships, etc., in CCNA-focused detail . Jeremy often includes lab\ndemos.\n- Keith Barker “OSPF Basics”  (YouTube, ~20 min) – Great conceptual explanation using whiteboard –\ncovers what LSAs are, basic link-state idea, without diving too deep (CCNA doesn’t require LSA types\nmemorization, but concept of link-state flooding is good to know).\n-  NetworkChuck “OSPF in 7 Minutes”  – Quick high-level recap or introduction to get the gist (as a\nsupplementary resource to keep it fun).\n- David Bombal Lab on OSPF  (if available on YT, e.g., “CCNA OSPF Lab Packet Tracer”) – Following along\na lab step-by-step can reinforce config and verification commands.\n- (Optional) “OSPF Neighbor States”  – if you want to go beyond, some videos explain the states (Down,\nInit, 2-Way, Exstart, Exchange, Loading, Full) – but at CCNA, just knowing Full adjacency and maybe 2-\nWay for DROTHERs is enough. If curious, watch a short explanation.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 2)  – Read the OSPF chapter very thoroughly. It likely covers single-area\nconfig, OSPF operation concepts, neighbor relationships, and troubleshooting tips. Make sure\nyou understand how OSPF identifies neighbors (by matching area, authentication (if any),\nsubnet, hello/dead timers, etc.). For CCNA, main things: matching subnet mask and area must\nmatch for adjacency; router ID selection (highest loopback IP or highest active IP if no manual\nID); the concept of DR/BDR on multiaccess networks – only one DR/BDR per network segment to\nreduce adjacencies.\nAny included labs or examples in the text – do them or simulate them in Packet Tracer as you\nread.\n“OSPF LSA Types Simplified”  (if in text or an appendix) – not required to memorize types, but\nreading a summary might help you understand how OSPF shares info (Link State29\n28\n9495\n•\n•\n•\n•\n23\n\nAdvertisements). CCNA might have a question like “Which routing protocol floods link-state\nadvertisements?” or “Which routing protocol uses cost as metric?” which you should easily\nanswer by now.\nIf you have a lab manual or guide , see if there’s an OSPF exercise; doing more than one OSPF lab\nis useful.\nResearch Papers/Articles:\nRFC 2328  – OSPFv2 Specification (again not to read fully, but maybe the intro and rationale). The\nfirst paragraph often states it’s a link-state routing protocol using SPF algorithm.\n“OSPF Neighbor Troubleshooting Checklist”  (Cisco Support) – gives common reasons two\nOSPF routers won’t form adjacency (e.g., area mismatch, IP mismatch, passive interface, etc.).\nKeep this as a reference to troubleshoot your labs if needed.\nPacketLife OSPF Cheat Sheet  – a one-page summary of OSPF, might list LSA types, state\nmachine, etc. Good for quick review or to see the big picture.\nCisco Design Guide excerpt  – maybe a section about when to use single-area vs multi-area\nOSPF (CCNA doesn’t require multi-area config, but understanding that large networks can be\nsegmented into areas is good).\n(Industry) “Why  OSPF  is  widely  used”  –  a  blog  or  article  extolling  OSPF’s  scalability,  fast\nconvergence, etc., compared to, say, RIP (which is outdated). Just to reinforce you’re learning a\nrelevant protocol.\nOnline Courses:\nCisco NetAcad – Enterprise Networking, Security & Automation (ENSA) v7  likely has OSPF in\ndepth. If available, do Module on OSPF (single-area). They will have Packet Tracer labs like\n“Configure Single-Area OSPFv2” and maybe an OSPF troubleshooting PT. Do these.\nBoson NetSim (optional)  if you have it or similar simulation with guided labs, try an OSPF lab\nscenario.\nGNS3 labs (optional)  – If you want more realism, you could try a GNS3 or CML lab for OSPF, but\nPacket Tracer suffices for CCNA-level OSPF.\nHands-On Labs/Projects:\nLab 8.1: OSPF Basic Configuration  – Use a 3 or 4-router topology (could reuse static routing lab\nbut remove static routes). Configure OSPF on all routers in Area 0. You can use the network\ncommands (e.g., network 10.0.0.0 0.0.0.255 area 0  to cover certain ranges, or identify\neach interface). Ensure all routers become neighbors (use show ip ospf neighbor ). Assign a\nLoopback interface on one router to observe how OSPF advertises it (it should appear as O IA or\nO route in others if not area 0? Actually in single area it’s just O). Expected Outcome:  All routers\nhave routes to all networks via OSPF in their routing tables. Test connectivity across the network.\nLab 8.2: OSPF Router ID and Neighbor Relationships  – In the above lab, set router IDs\nmanually ( router-id X.X.X.X ) that are easy to identify (e.g., 1.1.1.1 for R1, etc.). Reload\nOSPF (clear process) so they take effect. Observe neighbor outputs listing these IDs. Then\nsimulate a multiaccess segment: e.g., connect 3 routers to a single switch (or multi-point cloud)\nto simulate them on the same Ethernet. See in show ip ospf neighbor  which one is DR,\nBDR, DROTHER – by default highest router ID becomes DR. Try changing OSPF priority on one\nrouter to make it DR. Expected Outcome:  Understanding of DR/BDR election – only DR and BDR•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n24\n\nshow full adjacency with all, others (DROTHER) have 2-way with each other but full only with DR/\nBDR. For CCNA, just know conceptually, but seeing it is nice.\nLab 8.3: OSPF Passive Interface and Default Route  – Take one of your routers (like an edge\nrouter) and configure a default route (maybe to a fake internet cloud or a stub network) and\ninject it into OSPF (using default-information originate ). Make some interface passive\n(like LAN interfaces that shouldn’t form OSPF neighbor). Ensure OSPF still advertises the\nconnected networks but doesn’t try to neighbor on passive interfaces. Expected Outcome:  Your\ninternal routers receive a default route from OSPF (marked as O*E2 usually), and you\nunderstand passive-interface usage (security and efficiency to not send hellos on e.g. user LANs).\nLab 8.4: OSPFv3 for IPv6 (optional)  – If eager , configure OSPF for IPv6 on a dual-stack network.\nEven if just between two routers. This uses ipv6 ospf  commands on interfaces and router\nospf <id> ipv6 . Verify with show ipv6 ospf . Not heavily needed for CCNA, but one lab\nhelps reinforce OSPF knowledge and demystifies IPv6 routing.\n(Project) OSPF Study Notes  – Create a one-page “OSPF cheatsheet” in your own words: including\nOSPF  message  types  (Hello,  LSU,  LSA  concepts),  neighbor  requirements,  OSPF  metrics  and\ndefault reference bandwidth, and common show commands and their meaning. This act of\nsummarizing will prepare you for any exam question on OSPF as you’ll have organized the info\nyourself.\nQuizzes/Assessments:\nOSPF Concepts Quiz:  ~15-20 questions. Cover OSPF basics: e.g., “What algorithm does OSPF\nuse?” (SPF/Dijkstra), “How does OSPF elect DR?” (highest router ID or priority), “Which multicast\naddresses does OSPF use for updates?” (224.0.0.5, maybe too deep for CCNA, but possibly trivial\nQ), “What’s the default OSPF cost of a 100Mb link?” (1, since reference BW 100 Mb), etc. Mix\nconcept and config questions.\nOSPF Configuration Quiz:  ~5 questions focusing on interpretation: e.g., given partial show\nrunning-config , does OSPF appear correctly configured? Or “Which command verifies OSPF\nadjacencies?” (show ip ospf neighbor vs show ip route ospf).\nTroubleshoot scenario Q:  maybe a question: “Router A OSPF config has area 0, Router B has\narea 1 on their connected link – will they form adjacency?” (Answer: No, area mismatch). Include\none or two like that.\nReview of older topics:  a few questions from switching or static routing just to keep them fresh.\nPerhaps “What does a switch do if it doesn’t know destination MAC?” or “Which command on a\nswitch enables you to see if a port is in err-disabled state?” (to recall STP maybe).\nFlashcards: Expand OSPF deck – e.g., “Default OSPF Hello interval on Ethernet? (10s) Dead\ninterval? (40s)”, “OSPF AD? (110) vs EIGRP AD (90) vs static (1) – a bit of comparative knowledge\nhelps.”, “Neighbors not forming – check area, masks, timers, auth, MTU”. Reviewing these\nregularly will make OSPF second nature.\nTime Allocation (~14 hours):\n- Videos: ~3 hours (OSPF requires some time to digest)\n- Reading: ~3 hours (this is a heavy chapter likely; do it in segments)\n- Labs: ~6 hours (multiple OSPF labs as described; OSPF often requires tweaking and wait times for\nconvergence, so be patient)\n-  Quizzes/Review:  ~2  hours  (going  through  multi-choice  and  verifying  against  labs/reading  for\ncorrectness)\nMilestones & Checkpoints:\n- Milestone 1:  Configure a multi-router OSPF network and achieve full connectivity without any static•\n•\n•\n•\n•\n•\n•\n•\n•\n25\n\nroutes. Provide evidence: e.g., ping from one end to the other  and the routing table from a router\nshowing OSPF-learned routes. If you trust OSPF’s routes and they match expectations (correct subnets\nand next hops), you did it right.\n- Milestone 2:  Demonstrate understanding of OSPF neighbor relationships. For instance, intentionally\nmisconfigure a parameter (like area) to see adjacency fail, then correct it. Or identify in a multiaccess\nnetwork which router became DR and why. Jot down a brief explanation of OSPF neighbor states and\nroles in your notes (even if CCNA doesn’t test state names deeply, the process of explaining helps).\n- Milestone 3:  Score at least ~75-80% on OSPF quizzes. OSPF has nuance, so if you miss some, focus on\nthose  topics  again.  Key  point:  You  should  be  comfortable  with  reading  an  OSPF  config  and\nunderstanding what each part does (network statements, router-id, etc.), and interpreting show ip\nospf neighbor/route  outputs. If any output line confuses you, clarify it now (like OSPF route codes:\nO = intra-area, O IA = interarea, E1/E2 = external – CCNA mostly single area so probably O routes only).\n- Checkpoint:  With OSPF covered, you have tackled the most complex part of CCNA routing. Ensure you\nalso recall earlier routing topics: difference between OSPF and RIP/EIGRP (just basics: OSPF link-state vs\nRIP distance-vector), but note EIGRP is not in CCNA anymore aside from a mention. Double-check IP\nConnectivity blueprint: we’ve done static, OSPF, FHRP. The blueprint also lists understanding  routing\ntable components  and forwarding decision process , which we’ve done. Also, first-hop redundancy (done\nconceptually). At this stage, you can route within and between networks pretty proficiently! Month 3 is\nnot over – we’ll now apply this in context of IP services."
      },
      {
        "number": 9,
        "title": "IP Services – DHCP , NAT, and Network Services",
        "content": "Objectives (Week 9):\n- Understand and configure DHCP  (Dynamic Host Configuration Protocol) on Cisco devices : both\nDHCP server (on a router or multilayer switch) and DHCP relay (IP Helper). Know the DHCP process\n(DORA: Discover , Offer , Request, Ack) and what information is provided (IP, subnet mask, gateway, DNS,\netc.).\n- Set up  NAT (Network Address Translation)  on a router for IPv4: specifically  PAT (Port Address\nTranslation)  for allowing multiple internal hosts to share one public IP (this is the typical use case). Also\nknow static NAT (one-to-one) usage and configuration. CCNA expects you to configure and verify NAT in\nIOS.\n- Learn about  NTP (Network Time Protocol)  and configure a router or switch to use NTP client\nmode (sync with a server) and potentially act as NTP server for others. Understand the importance of\ntime sync in networks (for logging, certificates, etc.).\n- Cover SNMP and Syslog  concepts  – possibly configuration basics: setting up a SNMP community\non a router , and logging to a syslog server . We might not do deep labs on these, but at least know how\nto verify and the purpose (monitoring, network operations).\n-  Introduce  QoS  basics  (Quality  of  Service):  know  what  QoS  is  for  –  to  prioritize  certain  traffic.\nSpecifically, CCNA might mention classification and marking (DSCP values) and queueing strategies –\njust theoretical understanding. Possibly see how a router shows QoS config, but configuration likely not\nrequired.\n- Summarize IP Services domain topics and ensure each is touched: DNS  (role in network – not config on\nrouter , but know it translates names and often there’s a “ip name-server” command to allow router to\nresolve  names),  FTP/TFTP  uses  (for  file  transfer  e.g.,  router  IOS  upgrade  via  TFTP) ,  and  SSH\nconfiguration on Cisco devices (we did some in earlier labs implicitly, but ensure you can configure a\nrouter/switch for SSH access).\nResources:\n- Videos/Tutorials:\n- “DHCP Configuration on Cisco”  by Keith or Jeremy (YouTube, ~10 min) – demonstrates setting up a\nDHCP pool on a router and using a relay.9697\n98\n99\n100\n101\n26\n\n- Jeremy’s IT Lab Day 19 – DHCP  (YouTube, ~20 min) – likely covers DHCP concepts and a Packet Tracer\ndemo.\n- “NAT Explained + Config”  by NetworkChuck (YouTube, 15 min) – Chuck shows inside/local vs outside/\nglobal, typically with coffee shop analogy, then does a PAT config. Good for beginners to catch the idea.\n- Jeremy’s IT Lab Day 20 – NAT  (YouTube, ~30 min) – thorough NAT config demos including static, PAT,\nverification ( show ip nat translations  etc.).\n- “NTP and Syslog”  (CBT Nuggets or Pluralsight snippet, ~10 min) – explaining how to set timezone, NTP\nserver , and how syslog logging levels work. If not accessible, try a YouTube video on “Configuring NTP\non Cisco” (plenty of free ones, ~5 min).\n- (Optional) “SNMP Basics”  by Professor Messer (Network+ video, ~5 min) – covers SNMP v2 vs v3 basics\nand how SNMP is used. Enough for concept.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 2)  – It will have chapters on IP Services. Read sections on: DHCP (how to\nconfigure a DHCP server on IOS, and DHCP relay agent using ip helper-address ), NAT\n(inside/outside concepts, static vs pool vs PAT configuration, and common show commands),\nNTP (simple client config), DNS (just that a router can be a DNS client or we can use “ip host” to\nmap names, etc.), SNMP (just overview of community strings and basic SNMP operations GET/\nSET), Syslog (levels 0-7 and how to set logging). QoS likely has a short section – focus on\nunderstanding classification, marking (like DSCP), and trust boundaries in a campus (maybe\nbeyond CCNA but just in case).\nLab Manual / 31 Days  – likely has a day for NAT and one for DHCP. Go through those for more\npractice questions.\nCisco Press articles  – often there are short guides like “NAT Fundamentals” on Cisco website.\nUse if you need alternate explanation, especially the NAT address terminology.\nResearch Papers/Articles:\nRFC 2131  – DHCP protocol (just read a bit of intro if curious; know it’s UDP 67/68 for exam\npossibly).\nCisco Docs: “Configuring Network Address Translation”  – covers IOS commands and\nexamples for static NAT, PAT, etc.\n“Troubleshooting NAT”  article – common NAT issues (like not clearing NAT translations after\nconfig changes, or forgetting ACL for NAT if needed). Might not be needed if labs go smooth, but\ngood reading.\nNTP.org brief  – maybe a page explaining NTP strata, but CCNA probably won’t ask that. However ,\nnote NTP uses UDP 123, maybe an exam trivial.\nSNMP vs Syslog  – an article explaining how they differ for network monitoring.\nQoS Basics  – Cisco has a doc “IP QoS Intro” or search for “DiffServ QoS tutorial” to get the idea of\nwhat classification and PHB mean  (this correlates to blueprint mentioning PHB for QoS).\nOnline Courses:\nCisco NetAcad – ENSA Modules  likely cover NAT (there’s a known PT lab “Configure PAT”) and\nDHCP (“DHCP server PT activity”). Do those labs from NetAcad if you have them. They also cover\nNTP and maybe QoS basics.\nSkillsoft/Pluralsight  – if you have access, maybe one of their CCNA courses has a quick lab on\nDHCP and NAT. Not required, but extra perspective if needed. •\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n102 103\n•\n•\n•\n27\n\nTry HackMe / Packet Tracer mini-games  – not sure if any gamified content for these, but\nrunning through config is straightforward enough.\nHands-On Labs/Projects:\nLab 9.1: DHCP Server and Relay  – Take a router (or switch) as central and two networks: e.g.,\nRouter with two LAN interfaces: one LAN has a router directly connected to PCs, another LAN\nmaybe behind a switch. Configure one router as DHCP server  for both networks (two pools). For\nthe network where router isn’t directly connected (say a router connected to another router\nwhich connects to PCs), use DHCP Relay: on that intermediate router interface, configure ip\nhelper-address <DHCP-server-IP> . Test from PCs: they should get IPs in correct ranges\nalong with gateway (the router) and DNS if configured. Expected Outcome:  PC on each network\nreceives valid IP config via DHCP. Use show ip dhcp binding  on server to verify leases.\nLab 9.2: NAT/PAT Configuration  – Create a scenario: Router with an “inside” network (e.g.,\n192.168.10.0/24 with a couple PCs) and an “outside” network (simulate the internet or a stub\nnetwork with a server , using, say, 203.0.113.0/24). Configure PAT on the router so that all inside\naddresses can share the router’s outside IP. On PCs, set their gateway to the router inside IP. Test\nby pinging the “internet” server from a PC. It should work if NAT is correctly translating. Do\nshow ip nat translations  to see the dynamic entries (you’ll see inside local, inside global,\netc.). Also test something like port translation by maybe using a simulated service if possible, but\nping should suffice. Optionally, configure a static NAT  for one inside host (like make one PC\nreachable from outside on a static mapping). Try accessing it from the “outside” side. Expected\nOutcome:  Internal PCs reach outside resources with NAT functioning, and any static NAT\nmapping works for inbound.\nLab 9.3: NTP and Syslog  – If you have an accessible NTP server (maybe Packet Tracer can\nsimulate one, or use router as NTP master), configure routers to sync time. E.g., one router as\nNTP master (or actual public NTP if PT supports sending to an address but likely not), others as\nclients. Use show clock  to verify time sync. For Syslog, perhaps set up one router as a syslog\nreceiver by using a loopback as the “syslog server” (PT might not simulate an actual syslog server\napplication, but you can at least set logging <ip>  on devices). At minimum, configure\nlogging host on a router and generate some log (like interface up/down) to see if you get a\nmessage (in PT maybe use simulation mode to see syslog packet). If not possible, conceptually\nensure you know how to do it.\nLab 9.4: SNMP (optional)  – Configure a simple SNMP community on a router ( snmp-server\ncommunity PUBLIC RO ) and use a PC with a network monitoring tool (PT might not have that)\n– if not, skip actual test, just know the config.\nLab 9.5: End-to-End Network Build  – As a final project for Month 3, build a small company\nnetwork: 2 departments on separate VLANs (use a switch and router-on-stick or multilayer\nswitch for inter-VLAN), include a DHCP server for clients, use NAT on the edge router to an “ISP”,\nrun OSPF on internal routers if multiple. Also implement an ACL (access control list) as a simple\nfirewall to allow internal to outside, but block certain port maybe (we’ll do ACL more next week,\nbut you can preview). Essentially, combine multiple technologies into one coherent network.\nDocument the network diagram and configurations as if preparing for a handover to another\nengineer . Expected Outcome:  A multi-faceted network that mirrors a simplified enterprise:\nVLANs, routing (static or OSPF), NAT for internet, DHCP for hosts, etc. This is a synthesis exercise\nand also good practice for the capstone next month.\n(Project) Documentation  and  Diagrams:  Take  one  of  your  recent  labs  (like  the  NAT/DHCP\nnetwork) and create a professional-looking network diagram using a tool (Lucidchart, draw.io, or\neven  Packet  Tracer’s  drawing  tools).  Label  VLANs,  IPs,  device  names.  Write  a  brief  network•\n•\n•\n•\n•\n•\n•\n•\n28\n\ndocumentation  (couple  paragraphs)  describing  the  topology  and  addressing  scheme.  This\npractices the soft skill of documentation – very important for a network engineer .\nQuizzes/Assessments:\nDHCP/NAT Quiz:  ~15 questions. Example topics: DHCP message sequence, function of DHCP\nrelay, configuring DHCP pool options (like default-router command), NAT inside vs outside\nmeaning, how PAT differentiates flows (port numbers), identify NAT addresses given a translation\n(inside local/global definitions), etc. Possibly a scenario: “Host can’t get DHCP address – which\ncommand is missing?” or “After configuring NAT, inside hosts still can’t reach out – what could be\nwrong?” (like forgot ACL for NAT, or mis-set inside/outside interface).\nServices Quiz:  ~10 questions covering NTP (purpose, maybe which stratum or which port),\nSNMP (which version is secure? v3), Syslog (which level is Emergency? difference between level 0\nand 7), QoS (maybe one question: “What does QoS classification mean?”).\nSecurity intro Quiz:  Because next week is Security, maybe preview with a couple of simple Qs\nnow: e.g., “What is the purpose of an ACL?”, “Which command enables SSH on a Cisco\nswitch?” (for review if you did it), just to start thinking on security.\nFlashcards: Summarize NAT types, default ports for services (FTP 21, SSH 22, etc – not sure if\nCCNA requires memorizing many ports, but a handful of common ones is good), syslog levels (0\nEmergencies, 7 Debug), SNMP vs Syslog uses, and QoS terms (like congestion avoidance vs\ncongestion management, again maybe beyond CCNA detail).\nTime Allocation (~13 hours):\n- Videos: ~2 hours (services configs)\n- Reading: ~3 hours (multiple small topics to cover)\n- Labs: ~6 hours (lots of practical configuration this week)\n- Quizzes/Review: ~2 hours (covering various services, which might be lighter individually but many\ntopics)\nMilestones & Checkpoints:\n-  Milestone 1:  Configure a DHCP server on a router and verify clients get addresses. Show a sample\nclient IP config (from  ipconfig  in PT PC or just show dhcp binding) and ensure gateway/DNS is\ncorrectly  delivered.  If  something  failed,  note  how  you  fixed  it  (e.g.,  forgot  the  default-router\ncommand initially).\n-  Milestone  2:  Implement  PAT  and  demonstrate  an  inside  host  reaching  an  outside  host.  Use\nshow  ip  nat  translations  to  present  one  example  of  a  translation  (e.g.,\n192.168.10.5:12345 -> 203.0.113.2:randomPort ).  Be  able  to  explain  which  is  inside  local/\nglobal . If static NAT, show that outside can reach inside using the static mapping.\n- Milestone 3:  Set up NTP in lab or at least configure ntp server x.x.x.x  on a router . Confirm time\nsync (maybe use  debug ntp  if possible or  show ntp associations ). If not feasible, state the\ncommands used and expected result.\n- Milestone 4:  Write down in your notes an “IP Services summary” covering DHCP (ports 67/68, DORA),\nNAT (terms and commands), NTP (basics of client/server), SNMP (v2c vs v3), Syslog (levels 0-7), TFTP/FTP\nuse cases, and SSH vs Telnet difference. This is your cheat-sheet for quick recall.\n- Milestone 5:  Achieve 80%+ combined on the services quizzes. These are straightforward if you labbed\n– e.g., NAT can be confusing but if you practiced, it’s okay. Clarify any missed concept by re-reading that\nbit of Odom or using device outputs to understand.\n-  Checkpoint:  Now  the  core  network  engineering  skills  are  in  place  –  you’ve  handled  network\nfundamentals, switching, routing, and essential services. The remaining blueprint domains are Security\nand Automation, which we’ll cover in Month 4 and 5, along with lots of review and practice. Reflect on\nhow many configs you can now do: from VLANs to OSPF to NAT. That’s huge! Ensure all your lab files•\n•\n•\n•\n•\n104\n29\n\nand notes are organized – you might start revisiting them for exam review soon. Take a well-earned\nbreak and gear up for Security topics next.\nMotivation:  Three months down – you’re halfway through the timeline and have covered the lion’s share\nof technical topics. It’s normal if some things still feel complicated (OSPF or NAT confusions linger), but\nyou have time to refine via reviews and more practice. The key is: you’ve built a robust foundation . In\nthe next months, we’ll reinforce it with advanced topics and lots of reviews. Keep pushing forward;\nyou’re doing fantastic. Also, maybe start engaging with others (online forums, study groups) to test\nyour knowledge by answering questions – teaching is a great test of mastery. On to Month 4!"
      }
    ]
  },
  {
    "number": 4,
    "title": "Security Fundamentals and Advanced Networking",
    "focus": "Month 4 addresses the Security Fundamentals (15%) domain and ties up any leftover core topics. We will cover device security (passwords, AAA concepts), Layer 2 security (like port security, DHCP snooping) and wireless security. We’ll also introduce some automation basics (to prep for Month 5) and do heavy review this month – mock tests and revisiting weak spots. By the end of Month 4, you should have touched all exam topics at least once. Domains covered: Security Fundamentals (CCNA 5.0) and parts of Automation/Programmability (basic intro). Plus ongoing review of earlier domains.",
    "weeks": [
      {
        "number": 10,
        "title": "Device Security and Access Control",
        "content": "Objectives (Week 10):\n- Learn about  basic device hardening : setting strong  passwords  (console, VTY, enable secret) ,\nusing password policies (minimum length, complexity, etc.) , and the importance of disabling unused\nservices. Configure these on a lab router/switch.\n- Understand AAA (Authentication, Authorization, Accounting)  concepts : not configure in depth\n(that’s CCNP), but know that AAA can use local or external (RADIUS/TACACS+ servers). Understand how a\nCisco device can use a central server to authenticate admins. Possibly configure a simple local AAA\nauthentication for login as practice.\n- Configure  SSH on a Cisco device: generate RSA keys, set up username/password or AAA, and verify\nSSH login. Ensure Telnet is disabled (only SSH allowed).\n- Implement Port Security  on a switch : limit MAC addresses on a port (e.g., only allow one MAC and\nshutdown if violation). Test by connecting a different device to see the violation.\n- Implement ACLs (Access Control Lists)  on a router : Standard ACL vs Extended ACL differences.\nPractice creating a standard ACL to filter traffic (e.g., block one network from accessing another) and an\nextended ACL (e.g., permit HTTP but block Telnet). Apply ACLs inbound or outbound on interfaces\nappropriately and test.\n- Understand ACL best practices  and how they’re used for security (basic firewalling) and for control\nplane (e.g., line VTY ACL to limit who can SSH).\n- Cover Device login banners  (MOTD) for legal warning, and the concept of physical security (briefly).\n- This week is heavy on configuration – it solidifies as you do it practically.\nResources:\n- Videos/Tutorials:\n- Jeremy’s IT Lab Day 4 Lab – Basic Device Security  (YouTube, ~10 min) – likely covers setting console/\nVTY passwords, service password-encryption, etc., which you did partly in Month1 but review now with\nsecurity lens.\n- Keith Barker “SSH Configuration”  (YouTube, 8 min) – quick steps to enable SSH on a Cisco router/\nswitch.\n-  NetworkChuck “Port Security”  (YouTube, 10 min) – demonstration of setting up port security and44\n45\n105\n51\n50\n30\n\nshowing what happens on violation (with his typical energetic style, possibly caffeinated example).\n- CBT Nuggets “Standard vs Extended ACL”  (if access, ~10 min) – explains the difference and perhaps a\nscenario of each. Otherwise, try a free video by David Bombal on configuring ACLs.\n-  Kevin Wallace “ACL Wildcard Masking”  (YouTube, 5 min) – understanding wildcard masks in ACL\n(inversion of subnet mask). Many beginners find wildcard confusing, so ensure you get it.\n-  (Optional) “AAA and RADIUS/TACACS+”  (Network Direction on YT, ~15 min) – to conceptualize AAA.\nCCNA might only ask e.g., “What is an advantage of TACACS+ over RADIUS?” or “Which port does\nRADIUS use?” – maybe too deep, but know TACACS+ is Cisco, TCP, encrypts full payload; RADIUS is UDP,\nencrypts only password. Minor details.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 2)  – Read the Security Fundamentals chapter(s). Key topics: securing\ndevice access (passwords, SSH), Layer 2 security (port security, DHCP snooping, DAI), basics of\nVPNs (definition of site-to-site vs remote access) , and intro to AAA. Odom likely also covers\ndevice monitoring (like SNMP which we did) and an intro to network attacks (DoS, phishing, etc.)\n– know basic definitions of threats  and mitigations. Also read about ACLs  thoroughly –\nstandard ACL (numbered 1-99 or named), extended ACL (100-199 or named), and where to place\nthem (standard close to destination, extended close to source typically).\nEnsure to cover Layer 2 security : Odom will mention DHCP Snooping, ARP Inspection, Port Security\nas in blueprint . Understand what each does: DHCP Snooping prevents rogue DHCP servers;\nDAI relies on snooping to block fake ARP; Port Security limits MACs to prevent CAM table\noverflow attacks.\nThere might be mention of WLAN security  here (blueprint has WPA/WPA2/WPA3) – recall from\nearlier and know the differences (WPA2 uses AES-CCMP, WPA3 adds SAE, etc., but just basics).\nPossibly an overview of  Network Attack types  – e.g., VLAN hopping, spoofing, man-in-the-\nmiddle, etc., with mitigations. If present, read to be able to name a few common ones.\nResearch Papers/Articles:\nCisco Guide: “Configuring Secure Management Access”  – covers SSH setup, role-based CLI\nmaybe. Focus on SSH and strong passwords parts.\nCisco Port Security Best Practices  – find an article listing recommendations (like stick to one\nMAC per port for user ports, use violation shutdown).\nSANS paper on ACLs  – possibly, or just recall from earlier reading.\nCommon threats  – maybe a blog “Top 5 network attacks and how to prevent” to broaden your\nunderstanding: e.g., MAC flooding (countered by port security), DHCP spoofing (counter by\nDHCP Snooping), ARP poisoning (counter by DAI), etc.\nCisco Whitepaper: “Network Security Fundamentals”  – if any summary doc exists. Might\nreinforce CIA triad concept (Confidentiality, Integrity, Availability) – not sure if CCNA explicitly\ncovers that, but could mention if context arises.\nOnline Courses:\nCisco NetAcad – ENSA Module on Network Security : They have chapters on Access Control,\nperhaps AAA, VPN overview, etc. Do any Packet Tracer labs on ACLs (there’s often a PT “Configure\nand Verify ACLs”).\nPacket Tracer Activities  – Check PT for pre-made activities like “Port Security” or “Secure\nNetwork Device” – sometimes there are. •\n•\n106\n41\n•\n52\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n31\n\nCybrary/Free Cybersercurity content  – if you want more theory, but for CCNA probably not\nneeded beyond core principles.\nHands-On Labs/Projects:\nLab 10.1: Secure Management Config  – Take a lab router/switch, configure: an enable secret,\nlocal user account with privilege 15, console login using local, VTY login using local with\ntransport input SSH only, generate RSA keys, and test SSH from a PC. Also set service\npassword-encryption  (so your line passwords are encrypted in config). Finally, set a login\nbanner (MOTD). Expected Outcome:  You can only access the device via SSH with the correct\nuser/pass, and console also requires login. The config should show encrypted passwords.\nDocument these steps as if making a checklist (will be useful later).\nLab 10.2: Port Security Demo  – On a switch, pick an access port connected to a PC. Configure\nswitchport port-security  (default allows one MAC) and maybe violation shutdown .\nConnect the PC, see it works. Now disconnect that PC and connect a different device (or change\nthe MAC in PT by replacing the NIC or using another PC). The port should go into err-disable.\nCheck show port-security interface X  to see the violation count. Then re-enable the\nport ( shutdown/no shutdown ) and possibly set it to violation protect  mode to see\ndifference (in protect, won’t shut, but drops unknown MAC traffic). Expected Outcome:\nUnderstanding how port security can block devices beyond the first.\nLab 10.3: ACL Practice  – a) Standard ACL : On a router with two subnets (A and B), create a\nstandard ACL to block traffic from one specific host or subnet A from reaching subnet B. Apply it\ninbound on interface toward B. Test with pings: the blocked host should fail, others succeed. b)\nExtended ACL : e.g., block HTTP from one network to a server , but allow other traffic. Use an\nextended ACL applied appropriately. Alternatively, implement an ACL on VTY lines to allow only a\nspecific IP range to telnet/SSH to the router (for management plane security). Expected\nOutcome:  You can write ACL statements (with correct wildcard masks, host vs any keywords)\nand apply them correctly (right interface, right direction) to achieve desired filtering. Use show\naccess-lists  to see hit counts after tests.\nLab 10.4: Layer 2 Security  – If Packet Tracer supports, try enabling DHCP Snooping  on a switch\n(specify trusted ports vs untrusted) and then simulate a rogue DHCP (PT might not easily\nsimulate rogue server , but you can place a second DHCP server in a VLAN and see if snooping\nblocks it). Similarly, DAI needs ARP packets – may skip actual test, but know config. If not\nfeasible, at least review how to enable those (e.g., ip dhcp snooping  globally and per VLAN).\nLab 10.5: Wireless Security  – On a wireless router/AP in PT, try setting different security modes\n(WEP, WPA2, etc.) to see how a client connects with each. Note how a weak security (like WEP)\ncould be cracked (just conceptually). If possible, show that without knowing passphrase, client\ncan’t connect – obvious, but demonstrates necessity of proper Wi-Fi auth.\n(Project) Security Audit Checklist:  Create a checklist for securing a small network device: e.g., “1.\nSet enable secret, 2. Disable unused ports or put in unused VLAN, 3. Apply port security on\naccess ports, 4. Use SSH not Telnet, 5. Use strong passwords and maybe AAA, 6. Implement ACLs\nto limit access to network segments, 7. Enable logging and NTP for time sync (for accurate logs),\netc.” This can be compiled from Cisco best practices. Use this list to verify your own labs have no\nglaring holes.\nQuizzes/Assessments:\nDevice Security Quiz:  ~10 questions – e.g., “Which command encrypts all plaintext passwords in\nconfig?” (service password-encryption), “What does AAA stand for?”, “What is the default violation\nmode of port security?” (shutdown), “How many MACs by default if not specified?” (1), etc. •\n•\n•\n•\n•\n•\n•\n•\n•\n•\n32\n\nACL Quiz:  ~10 questions – test understanding of wildcards (like “Which wildcard matches\n192.168.5.0/255.255.255.0?” answer 0.0.0.255), order of ACL, extended ACL format (src/dst IP and\nports), maybe identify what an ACL will do from lines given.\nSecurity Concepts Quiz:  ~10 questions – cover general: difference between threat, vulnerability,\nexploit ; VPN types  (just definition of site-to-site vs remote-access), wireless security\ndifferences, AAA differences (TACACS+ vs RADIUS), maybe one on CIA triad or social engineering.\nPrevious domains mixed quiz:  Add 5-10 questions from routing/switching to keep memory\nfresh (maybe you can take a small mixed practice test from a site/book).\nFlashcards: Terms to memorize: e.g., “DHCP Snooping – prevents rogue server”, “port security\ndefault aging: what? (by default secure MAC doesn’t age out unless configured)”, “Standard ACL\nrange (1-99)”, “Extended ACL range (100-199)”, “Well-known ports: 20/21 FTP, 22 SSH, 23 Telnet,\n53 DNS, 69 TFTP, 80 HTTP, 443 HTTPS, 161 SNMP, etc., to answer any odd question or just to\nknow for ACL port filters)”. Also maybe “WPA3 uses SAE (Dragonfly handshake)”.\nTime Allocation (~13 hours):\n- Videos: ~2 hours\n- Reading: ~3 hours (security chapters)\n- Labs: ~5-6 hours (multiple short config labs)\n- Quizzes/Review: ~2 hours\nMilestones & Checkpoints:\n- Milestone 1:  Harden a device and verify: e.g., a switch that only allows SSH login with a specific user ,\nand has console secured. Attempt to telnet (should fail), attempt SSH with wrong user (fail), right user\n(success). If possible, get a peer to try to “break in” (or just simulate by trying defaults) to ensure it’s\nsecure.\n- Milestone 2:  Successfully use port security to shut down a port on unauthorized device connection.\nCheck that you know how to bring it back ( errdisable recovery  or manual shut/no shut).\n-  Milestone 3:  Implemented ACLs that work as intended. Document one example: “Standard ACL 10\nblocking Network X applied on interface G0/0 inbound blocked traffic successfully as shown by ping\ntests.” Also note ACL best practice (like placing, and remember implicit deny at end).\n-  Milestone 4:  Quick-fire: be able to answer “How to mitigate X?” for the common threats: e.g., MAC\nflooding -> Port Security, rogue DHCP -> DHCP Snooping, ARP Poisoning -> DAI, brute-force on device ->\nstrong passwords & login delay, etc. You don’t need to know deep, just a one-liner mitigation.\n- Milestone 5:  Achieve ~80% across security quizzes. If there’s any term or tech you missed, review it.\nFor instance, if you blanked on “what does SNMPv3 add” (security), just note it down. If ACL logic\nconfused you (like order of lines or implicit deny), clarify with more practice.\n- Checkpoint:  At this point, you have completed an initial pass through all CCNA domains . Congrats!\nYou likely have a pile of notes, lab configs, and flashcards. For the remainder of Month 4 and in Month\n5, we’ll focus on  automation  plus heavy  review and practice exams  to solidify everything. Use this\ncheckpoint to identify your weakest areas – maybe it’s OSPF, or ACLs, or subnetting under time. Flag\nthem for extra attention in coming weeks.\nMotivation:  Security can be detail-heavy, but you’ve grasped how to lock down a network which is a\ncritical skill. It’s satisfying to break and then secure something. Remember , skills like ACLs and port\nsecurity are not only exam topics but practical tools  – your future network engineer self will thank\nyou for mastering them now. Keep those study habits strong; you’re in the home stretch of content\ncoverage.  Month  5  will  introduce  the  final  piece  (Automation)  and  then  it’s  all  about  integrating\nknowledge and practice tests.•\n•\n41 107\n•\n•\n33"
      },
      {
        "number": 11,
        "title": "Automation & Programmability Fundamentals",
        "content": "Objectives (Week 11):\n- Grasp why network automation  and programmability are emerging: the need for scale, consistency,\nand integration with DevOps. Understand terms like SDN (Software-Defined Networking)  – separating\ncontrol plane and data plane, and APIs (Application Programming Interfaces)  – how software can interact\nwith network devices.\n- Learn about REST APIs  in the context of networking: e.g., Cisco’s RESTful APIs (like those on Cisco\nDNA Center or even some on IOS-XE). Understand what CRUD means (Create, Read, Update, Delete)\nand that these map to HTTP verbs (POST, GET, PUT/PATCH, DELETE).\n- Get exposure to data formats like  JSON  (JavaScript Object Notation) and maybe XML – CCNA\nexpects you to recognize JSON output and basic structure (key:value pairs, nested). Practice reading a\nJSON snippet and locating a piece of data (like an IP address in a JSON of interface info).\n- Explore  network automation tools : Know of Puppet, Chef, Ansible (just what they are, not how to\nuse) . Ansible is popular for network automation (YAML playbooks). Puppet/Chef are more used in\nserver world but Cisco wants you aware.\n- Basic scripting intro: write a very simple  Python script  to retrieve or configure something, or just\nparse some output. If you’re new to coding, at least understand a provided Python script that uses a\nlibrary like netmiko  or requests to call a REST API. We won’t become coders in a week, but break the\nice.\n- Use Cisco’s DevNet resources if possible: maybe use the Cisco DevNet sandbox or their always-on\nsandboxes for DNA Center or CSR1000v API to try a sample API call (alternatively, use Packet Tracer’s\nnew REST-based multiuser feature if exists, or just conceptual).\n- Tie back to exam: ensure you can answer conceptual Qs like “What is the benefit of controller-based\nnetworking?” , “What is an example of southbound API vs northbound API?”  (Southbound: e.g.,\nOpenFlow, NETCONF; Northbound: REST API to controller). Recognize JSON and interpret it.\n- This week is more about reading/understanding than heavy lab, unless you’re comfortable to try some\ncoding.\nResources:\n- Videos/Tutorials:\n-  Cisco DevNet “Networking 101: APIs”  (YouTube, ~10 min) – an explanation by Hank Preston or\nsimilar about using APIs in network management.\n- NetworkChuck “REST APIs for Beginners”  (YouTube, 15 min) – not network specific, but covers what\nan API is in simple terms, using maybe a public API example.\n-  David Bombal “JSON and Postman for CCNA”  (YouTube, ~20 min) – David often covers new CCNA\ntopics; he may have one showing how to use Postman (an API client) to query a Cisco controller and get\nJSON data. This could be very practical to watch.\n- “SDN and Controllers”  by Keith Barker (YouTube, ~12 min) – conceptual explanation of SDN and Cisco\nDNA Center as an example, plus traditional vs SDN differences.\n- CBT Nuggets “Automation and Programmability Basics”  (if access) – might have a high-level video\nsummarizing these emerging tech within CCNA scope.\n- (Optional) “Python for Network Engineers Crash”  (YouTube, e.g., by Kirk Byers or others, 1 hour or\nmore) – only if you have time/interest to go deeper . Focus on simpler: how to open a SSH connection\nwith netmiko, or parse an IP from a text using Python regex. But that may be beyond what’s needed.\nBooks/Chapters:\nCCNA Cert Guide (Vol. 2)  – The last chapter(s) on Automation & Programmability. Read all\nsections: Network Architectures (controller-based vs traditional), APIs (northbound/southbound),\nconfiguration management tools (just understand they manage configs and ensure desired108\n109\n61\n65\n63\n110 58\n•\n•\n34\n\nstate), Cisco DNA Center & SD-Access overview (fabric, overlay/underlay concepts from blueprint)\n, JSON data format (they might show an example and point out how to pick values) .\nThere might also be mention of model-driven programmability (YANG models, NETCONF) – just\nnote those words, maybe one exam Q.\nCisco DevNet Assoc. book  (if any excerpt is available) – might have overlapping content with\nCCNA automation section for deeper interest.\nAppendix or Additional Reading:  Odom might reference some DevNet resources; check if any\nrecommended reading on JSON or APIs.\nResearch Papers/Articles:\nCisco Whitepaper: “Intent-Based Networking”  – describes concept behind controllers like DNA\nCenter (which uses intent-based policies). Good to get buzzwords like “intent, automation,\nassurance”.\nBlog: “APIs for Network Engineers”  – a blog by a network engineer who learned Python,\nexplaining how they use REST APIs to get device info.\nJSON tutorial  – lots online, but maybe an interactive one where you view a JSON example. If not,\neven Wikipedia JSON page shows an example to interpret.\nDevNet “Hello Network!” lab  – if you register on Cisco DevNet (free), they have some guided\nlabs on using sandbox. Maybe try “REST API Basics” or “Always-On Sandbox demo”.\nOpenFlow overview  – just read what OpenFlow is historically (protocol for controllers to\nprogram switches – used in early SDN, now not as talked, but part of history).\nTerraform/Chef/Puppet  – no need detail, just know these are Infrastructure as Code (IaC) tools,\nbeyond CCNA likely.\nOnline Courses:\nCisco NetAcad – DevNet Associate course  (if available, not sure if free). If accessible, might\nhave beginner labs on using Postman to query Cisco DNA.\nPostman or curl practice : If you have access to a network device with API (maybe PT doesn’t\nhave, but you could install Cisco Packet Tracer and see if it supports some API?), alternative: use\na dummy public API (like a weather API) in Postman just to get comfortable with GET/POST and\nsee JSON.\nCoding practice : if new to Python, perhaps use an interactive site like Codecademy for a couple\nof Python lessons just so you can read code. But time is short; if you already code a bit, maybe\nattempt something small like using Python to read a JSON file.\nHands-On Labs/Projects:\nLab 11.1: Explore a REST API  – Use a tool like Postman (install on your computer) or Python\nrequests  library to GET data from an API. If you don’t have a Cisco device API, use something\nlike httpbin or a dummy JSON API. Alternatively, many Cisco devices have an HTTP interface you\ncould enable (not secure, but for test). If you can, enable REST API on a DevNet sandbox or\nCSR1000v VM (this might be advanced – if not, skip doing it yourself). At least, open a sample\nJSON file (maybe Odom’s book has one, or find on DevNet) and try to pick out key info. Expected\nOutcome:  You understand how an API call returns structured data (JSON) and how it differs\nfrom CLI show output. 108 65\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n35\n\nLab 11.2: Simple Python Script  – Write or copy a short script that does something like “print all\nIP addresses in this JSON” or “SSH to router and run show ip int brief (using netmiko)”. If you’ve\nnever coded, ask a programmer friend or find a ready script from DevNet Code Exchange.\nRunning it successfully and seeing output is the goal. If not comfortable, at least go through the\nthought: how would automation save time vs manual CLI (imagine configuring 100 VLANs on 10\nswitches – script can do it faster with less error).\nLab 11.3: Controller Demo  – If possible, watch a demo or recording of Cisco DNA Center or\nPacket Tracer’s SDN Controller (PT has a “Controller” object for SDN but not sure how functional).\nAt least conceptually: one central controller can push VLAN configs to all switches or do dynamic\npath optimization. Recognize how this differs from logging individually.\nLab 11.4: JSON Parsing Exercise  – Create a small JSON structure (or use sample) that includes\nnetwork info, e.g.: {\"interface\": \"Gig0/1\", \"ip_address\": \"10.0.0.1\", \"status\":\n\"up\"}. Write down how you’d access the IP address field (answer: by key \"ip_address\"). Maybe\ntest with a Python one-liner if possible: import json; data=json.loads(<jsonstring>);\nprint(data[\"interface\"])  to print values. Expected Outcome:  Not to memorize syntax but\nto demystify JSON (it’s just text with keys/values, often easier than parsing CLI output).\n(Project) Automation Strategy Proposal:  Imagine you manage 50 switches – list 3 tasks you\nwould  script/automate  (e.g.,  backup  configs  nightly,  bulk  update  SNMP  community,  verify\ninterfaces up). For each, describe how automation helps (less error , schedule it, etc.). This isn’t on\nexam, but thinking this way prepares you for real network engineering in modern environments\nand gives context to why Cisco added this domain.\nQuizzes/Assessments:\nAutomation Concepts Quiz:  ~10-15 questions. Cover north vs southbound API, e.g., “Which is a\nsouthbound API? a) REST to DNA Center , b) NETCONF to routers, c) web dashboard GUI\n(northbound example).” Ask about benefits of automation (fewer errors, consistency, speed).\nMaybe “Which data format is easiest for machines to parse? JSON vs XML vs YAML – arguably\nJSON/YAML both fine, but JSON is ubiquitous). Some basic Python logic like “which of these is a\ncorrect list syntax in Python?” or maybe not – CCNA not a coding test but might have pseudo-\ncode trace (but rarely). If any question, likely identify JSON vs XML or a Python snippet output.\nFor instance, they may show a JSON and ask “what is the value of X key?” – test if you can read\nJSON. Or a Python print(data[\"ip\"])  and ask what it does (print the value of \"ip\" key from\ndata dictionary). If you’ve done above exercises, you’d get it.\nDevOps Tool Quiz:  ~5 questions – maybe matching “Puppet/Chef” to “uses declarative manifests\nand agent on nodes” vs “Ansible uses SSH, agentless, uses YAML playbooks” vs “SaltStack, etc.” If\nCCNA doesn’t go deep, maybe one question: “Which tool uses a push model? (Ansible) vs pull\nmodel (Puppet)”. But likely just identify these as automation/config management tools.\nFull-length Practice Exam #1:  This is a good point to take a full CCNA practice exam  (60-70\nquestions, 2 hours). Use Boson ExSim if you have it (highly recommended ) or the Cisco\nOfficial Practice if available, or a free one (ExamTopics – but caution, verify answers). Simulate\nexam conditions: 120 min timer , no notes. Afterward, grade and analyze every question , especially\nthe ones you got wrong or guessed. This will highlight any weak areas to focus on in Week 12\nand Month 5 review.\nContinue Flashcards: add any new ones (like “API = Application Programming Interface, allows\nsoftware to communicate via defined requests”, “CRUD = Create,Read,Update,Delete”, sample\nJSON syntax). Also maybe flashcard any facts you got wrong in practice exam. By now, flashcards\nshould be a sizable deck – keep doing daily reviews; it’s a great retention tool up to exam day. •\n•\n•\n•\n•\n•\n•\n•\n111 112\n•\n36\n\nTime Allocation (~12 hours):\n- Videos: ~2 hours\n- Reading/learning: ~3 hours\n- Hands-on (if doing script/API calls): ~3 hours (maybe more if really diving, adjust as needed)\n- Practice Exam and review: ~4 hours (2h exam, 2h review)\nMilestones & Checkpoints:\n-  Milestone  1:  Write  a  short  explanation  (4-5  sentences)  of  the  difference  between  traditional\nnetworking vs controller-based. E.g., “Traditional: each device configured individually (CLI), control plane\ndistributed; Controller-based: central brain (controller) tells devices how to forward, devices are simpler ,\neasier to enforce policies network-wide.” If you can articulate that, you got the core idea .\n-  Milestone  2:  Interpret  a  given  JSON.  For  instance,  take:  {\"device\": {\"name\": \"R1\",\n\"interfaces\":  [{\"name\":  \"Gig0/0\",  \"ip\":\"10.0.0.1\"},\n{\"name\":\"Gig0/1\",\"ip\":\"10.0.1.1\"}]}} . Answer: how many interfaces does R1 have and what\nare their IPs? (Should be: 2 interfaces, IPs 10.0.0.1 and 10.0.1.1). If you can do that, you’re good for JSON\ninterpretation .\n- Milestone 3:  (Optional but cool) Successfully run a simple network automation action – whether it’s an\nAPI GET retrieving something or using a script to login and run a command. If accomplished, celebrate\n– you’ve stepped into netprog! If not, at least know what such a script would generally look like.\n- Milestone 4:  Complete the full practice exam and identify improvement areas. Suppose you scored,\nsay, 70% – not bad for first full attempt; list which sections had wrong answers. Make a plan to review\nthose (which we’ll do Week 12 and Month 5). If you scored 90% – great, but still review any misses and\nnote if it was luck on some guesses; ensure those are solidified.\n-  Checkpoint:  Content  learning  phase  is  nearly  done.  All  topics  are  covered.  The  focus  shifts  to\nreinforcing knowledge, practicing scenarios, and test readiness . Compare where you were at Month\n1 vs now – impressive progress, right? The next step: refine until you’re consistently exam-ready and\nconfident  in  practical  skills  too.  Use  Month  5  for  that  polishing,  plus  a  capstone  project  to  apply\neverything.\nMotivation:  Automation is a new frontier – don’t worry if you felt like a newbie again here. The CCNA only\ndips a toe into programmability; mastery comes with practice over time. The key takeaway is you now\nknow what’s possible  and won’t be intimidated by terms like JSON or API in the field. Embrace a growth\nmindset – network engineering is evolving and so are you. Now, let’s gear up for the final phase: intense\nreview, practice tests, and a big capstone lab to ensure you’re more than ready for the exam and the job\nmarket."
      },
      {
        "number": 12,
        "title": "Comprehensive Review and Mock Exam",
        "content": "Objectives (Week 12):\n- Systematic review  of all domains: Each day of this week, focus on one domain’s key points and “must-\nknow” facts/configs. E.g., Day1: Network Fundamentals recap, Day2: Network Access recap, etc. Use\nyour notes, flashcards, and maybe re-watch 2x speed videos or skim chapters to reinforce.\n- Identify and fill any remaining gaps: If certain labs were skipped or still shaky (maybe IPv6 or OSPF\narea type details), address them now with quick labs or reading.\n- Take at least one more full-length mock exam  (preferably a different set of questions than week 11’s).\nAim to exceed the passing score margin (target ~90% so you have cushion).\n- Practice Simulations and practical scenarios : If you have access to simulation-style questions (like\nconfiguring  something  under  time),  practice  a  couple.  If  not,  create  your  own  mini-scenarios  to\nconfigure without looking at guides (like: “Configure OSPF on these routers, with passive interface on\nLAN, and default route advertisement – go!” and see if you can do it quickly).\n-  Refine  test-taking  strategies:  manage  time  (approx  1  min/question,  more  for  sim),  flag  tough110\n65\n37\n\nquestions and move on, eliminate wrong answers in MCQs by logic, etc. Train your brain to stay calm\nand methodical during the exam.\n- Ensure you are ready with practical skills as well: though CCNA is theory + some sim, for job readiness,\nensure you can do the common tasks without peeking at notes now.\n- By end of week, be exam-ready and also ready to apply knowledge in a capstone project next month.\nResources:\n- Videos:\n- Watch any “Last minute CCNA review” videos (there are often 1-2 hour marathon reviews on YouTube\nsummarizing key points). E.g., “CCNA in 120 minutes” type videos – good for high-level catch-all revision.\n- Exam tips videos  (many CCNA mentors have “tips to pass” with advice on question wording, how to\nnot overthink, etc.). This might ease anxiety and give insight on Cisco’s style.\n- If certain topics still fuzzy, revisit those specific video sections at higher speed for clarity.\nReading:\nSkim through your compiled notes and highlight anything you’d hesitate on if asked outright. If\nyou find any, clarify immediately (look up that detail).\nRe-read the exam blueprint list we compiled at the beginning. Can you give a sentence or two\nabout each sub-bullet if asked? If not, review those.\nIf you have the Odom books, the end-of-book “Key Topics” and “Do I Know This Already” quizzes\nare excellent for quick review. Use those as a checklist.\nPractice exams:\nBoson ExSim – do Exam B (if you did A earlier) under exam conditions. Review thoroughly.\nPearson/Cisco Official Practice exam (if you have it).\nTake some free online quizzes for variety (careful with brain dump sites; better use reputable\nones like Todd Lammle’s site or others with practice Qs).\nIf scoring consistently ~85%+, that’s a good sign. If below ~80%, identify why – content gap or\ntricky wording? Fix content gaps and practice interpreting wording (dissect what the question\nreally asks).\nLab practice:\nQuickly lab any config that you don’t feel second-nature: e.g., “Setting up trunk + EtherChannel”\nquickly, or “One static NAT and one PAT” quickly. This just builds muscle memory and confidence.\nIf possible, do a timed lab: e.g., give yourself 30 minutes to configure a small network from\nscratch (3 routers OSPF + 2 VLANs + NAT, etc.). This isn’t for exam (they won’t be that extensive\ndue to time), but for you to consolidate integration of topics.\nEnsure you know how to verify and troubleshoot in labs swiftly: e.g., commands like  ping,\ntraceroute ,  show ip int brief ,  show cdp neighbors , etc., should come to mind\neasily to diagnose things, because some exam sims might require troubleshooting a misconfig.\nFlashcards:\nBy now you have many flashcards – keep reviewing daily, but also start trimming ones you\nalways get right (or mark them as known). Focus on ones you still slip on. •\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n38\n\nThe day before exam (in plan, that’s next month), you might just skim through all to ensure\nnothing forgotten.\nHealth/Mental Prep:\nThis is part of review week too: Plan your exam logistics (if you intend to take it right after Month\n5, schedule it now so you have a date !). Having it scheduled will drive you.\nEnsure you get good rest and not burn out this week – if you study too hard without breaks,\nretention drops. Take short breaks, stay hydrated, exercise a bit.\nPractice some mindfulness or positive visualization: imagine opening your exam result with a\npass – that’s motivating and calms nerves.\nMilestones & Checkpoints:\n- Milestone 1:  Score well on Mock Exam(s). For instance, if Boson exam gives scores per section, ensure\nnone of the six domains is below ~80%. If one is, revisit that domain’s content until you can raise it.\n-  Milestone 2:  Conduct a thorough  self-assessment : Print out (or write down) each exam blueprint\ntopic and rate your confidence 1-5. For any 3 or below, do a targeted review. After review, all should be 4\nor 5 (meaning “I could answer an exam question or do a basic lab on this”).\n- Milestone 3:  Complete a final lab or troubleshoot challenge without hints, successfully. For example,\npurposely break something in a network (like an OSPF area mismatch or an ACL blocking a service) and\nsee if you can find and fix it quickly. This shows you can apply knowledge dynamically, which is great for\njob skills.\n- Milestone 4:  Organize your study materials for next month’s capstone and job prep: e.g., have your\nbest notes and diagrams ready to refer to when designing the final project and for interview prep (it’s\nhandy to show or at least talk about a project with documentation).\n- Checkpoint:  You should now feel ready to schedule or soon take the CCNA exam . If not, identify what’s\nholding you back – content, test anxiety, etc. This plan assumed exam after 6 months; if you’re ahead of\nschedule and feel ready now, you could even take it earlier . If not, adjust plan to do more practice where\nneeded. The key is mastery and confidence.\nMotivation:  You are basically at the summit of CCNA preparation. The view is great – look back at all the\nconcepts you’ve mastered! This week’s intense review might be tiring, but think of it as polishing a gem:\nyou’re  refining  rough  edges  so  you  can  shine  on  exam  day.  Keep  the  momentum  but  also  start\nenvisioning life post-exam (the next section will help with that – job prep, etc.). Remember , the goal is\nnot just to pass an exam, but to become a capable network engineer , and you’re well on your way."
      }
    ]
  },
  {
    "number": 5,
    "title": "Final Prep, Capstone Project, and Exam Readiness",
    "focus": "Month 5 is about consolidation and application . We will integrate everything in a realistic capstone project , do last-mile prep with mock exams and flashcards, and finally take (and pass!) the CCNA exam likely in Week 4 or end of this month. Post-exam, we’ll transition to job preparation tasks. (If you plan to take the exam in Month 6 instead, you can adjust accordingly, but this plan assumes by end of Month 5 you attempt the exam).",
    "weeks": [
      {
        "number": 13,
        "title": "Capstone Network Design Project – Plan",
        "content": "Objectives (Week 13):\n- Begin a  capstone project : designing a small enterprise network from scratch, incorporating most\ntechnologies  learned.  This  week,  focus  on  planning  and  design  on  “paper”  (or  software)  before\nimplementation next week.\n-  Scenario:  You are tasked to design a network for a small company with, say, 3 departments (like•\n•\n•\n71\n•\n•\n39\n\nAdmin, Engineering, Sales), two sites (HQ and Branch), and internet connectivity. They require: VLANs\nper  department,  inter-site  routing,  internet  access  for  all  via  HQ,  secure  remote  access  for  a  few\nemployees (VPN), and basic network security measures.\n- Create a  network diagram  of this topology: likely includes routers at each site, switches, maybe a\nfirewall (optional, or use router ACL as firewall), an ISP cloud, and maybe a server network.\n- Plan IP addressing: assign subnets to each VLAN and site, ensuring summarization if possible and\navoiding overlaps. Perhaps use private IPs internally and one public range for NAT at HQ.\n- Choose and justify routing: e.g., use OSPF between sites (maybe over a simulated WAN), static default\nto internet, etc. - Plan out where to apply security: e.g., port security on user ports, ACL on router to\nfilter internet traffic, VPN using perhaps Packet Tracer’s VPN feature (if any, else just conceptual).\n- Essentially, write a network design document : including network requirements, IP scheme, device\nroles, protocols, and security measures.\n- Get feedback if possible: if you have a mentor or friend in networking, show them the design for\ncritique. If not, self-review by comparing to reference architectures from Cisco (e.g., Enterprise Network\nModel).\nResources:\n- Reference Designs:\n- Cisco Validated Designs or CCNA case studies. Perhaps Cisco Press CCNA books had a final chapter\nwith a case study network – use that as inspiration or reference.\n- The old “Hierarchical Network Model” (Core/Dist/Access) – since we have HQ and Branch, maybe HQ\nhas a core switch and some access switches. Use two-tier design (collapsed core) given small size.\n- Subnet calculators  (to double-check your addressing plan efficiency).\n- Visio or draw.io stencils  – for making a nice diagram. (Or Packet Tracer’s built-in drawing for a quick\nvisual).\nDesign considerations:\nVLAN for each department (plus maybe a management VLAN, and a VLAN for voice if any VoIP –\noptional).\nRedundancy: maybe not a huge network, but could have two switches at HQ with EtherChannel\nand HSRP for gateway redundancy as a bonus. If it complicates, keep it smaller .\nBranch could be simpler (one router , one switch).\nWAN link: simulate maybe as a serial or just an IP cloud. If using PT, can connect routers via\ncloud or directly.\nSecurity: plan where to put an ACL (likely on HQ router outbound to internet to restrict certain\ntraffic, and inbound from internet to allow only VPN or necessary).\nVPN: If PT supports GRE or IPsec, perhaps plan an IPsec tunnel between HQ and Branch or for\nremote user – if not, just state it.\nAutomation: not required in design, but you can mention future plan to use Ansible for\nconsistency.\nMilestones & Checkpoints:\n- Milestone 1:  Complete a network diagram  of the proposed design, showing all subnets and VLAN\nIDs, device names, interfaces, and relevant IP addresses. This is the blueprint for your implementation.\n-  Milestone 2:  Write out the  IP addressing plan : e.g., “192.168.10.0/24 – Admin VLAN 10 at HQ (50\nusers), 192.168.20.0/24 – Eng VLAN 20 at HQ (30 users), 192.168.30.0/24 – Sales VLAN 30 at HQ (20\nusers), 192.168.40.0/24 – Branch office LAN (30 users). WAN: 10.0.0.0/30 between HQ and Branch.”\nEnsure the sizing fits (no VLAN has more IPs than needed but leave some growth).\n- Milestone 3:  Enumerate the technologies to use: “OSPF area 0 between HQ and Branch routers; Inter-\nVLAN routing via multilayer switch at HQ or router-on-a-stick; PAT on HQ router for internet; Port\nsecurity on access ports (max 2 MAC for phones+PC maybe); DHCP from HQ server/router; ACL on HQ•\n•\n•\n•\n•\n•\n•\n•\n40\n\nrouter to block certain ports (e.g., disallow telnet from outside); Site-to-site VPN planned (conceptual).”\nThis list will guide config.\n-  Checkpoint:  Validate the plan against CCNA topics: did you include at least something from each\ndomain?  Likely  yes:  VLANs  (Network  Access),  OSPF  (IP  Connectivity),  NAT/DHCP  (IP  Services),  ACL/\nsecurity (Security Fundamentals), maybe mention of automation (like “we will use SSH and maybe\nnetwork scripts for config backup” for Automation, albeit light). The aim is to demonstrate holistic\nunderstanding.\n- Next step will be implementing and testing this design in Week 14.\nMotivation:  Designing a network from scratch is the ultimate test of understanding – it forces you to\nconsider how pieces fit together . Don’t worry if you have to adjust along the way (that’s normal). Enjoy\nthis creative and analytical process – it resembles real job tasks. You’re effectively acting as a network\nengineer/architect now, which is exactly the outcome we wanted. Take pride in that!"
      },
      {
        "number": 14,
        "title": "Capstone Network Implementation and Test",
        "content": "Objectives (Week 14):\n- Implement the designed network in Packet Tracer (or real gear if accessible) step-by-step.\n- Configure VLANs and trunking at HQ, set up inter-VLAN routing (either a layer 3 switch SVIs or a\nrouter-on-a-stick). Configure OSPF between HQ and Branch routers, ensure routes exchanged.\n- Set up DHCP server (maybe at HQ for all subnets, using DHCP relay to branch). Set up NAT on HQ for\ninternet access simulation (use a loopback or cloud as Internet).\n- Apply security: port security on switches, ACL on HQ router for traffic filtering, secure device configs\n(SSH login). If possible, configure an IPsec VPN between HQ and Branch (PT might have a “VPN easy”\noption on routers – if not, simulate by just allowing direct since it’s lab).\n- Test end-to-end: from a PC in each VLAN, ping others, ping branch, ping internet (maybe simulate\ninternet as a server in a different network beyond HQ router). Test fail-safes if any (e.g., if you did HSRP\nwith two routers at HQ, shut one to see continuity).\n- Troubleshoot any issues encountered – this is likely. It’s part of learning: maybe OSPF adjacency fails\ndue to passive interface or NAT issues. Work through them systematically (like you would on exam sims\nor real world).\n- Once stable, document the configuration : save config files, and perhaps write an executive summary\nof the network to accompany the diagram.\n- This project is also material you can mention in interviews or on a resume (it’s home lab, but it shows\ninitiative and skills).\nResources:\n-  Packet Tracer : Use PT’s multi-tab to keep track of different config sections (and it allows notes on\ntopology).\n- Prior labs : You basically will reuse many configurations from prior weeks but combined. Refer back if\nneeded (no shame in checking a command if memory is unsure – in real world you’d check docs – but\ntry to recall first).\n- Peer review : if you know someone else in CCNA, maybe share your Packet Tracer file for them to test,\nand vice versa. Fresh eyes might catch config mistakes.\nMilestones & Checkpoints:\n- Milestone 1:  All critical configs done: VLANs, OSPF, NAT, DHCP, ACLs, port security. The network should\nbe functioning as intended. For example: Users get IP via DHCP, can reach resources in other VLANs and\nbranch, internet pings go out (maybe not real internet but a fake server), and disallowed traffic is\nindeed blocked by ACL.\n- Milestone 2:  Testing results documented. Make a table: each VLAN PC -> where should it reach and\n41\n\nnot reach? Test ping/HTTP etc. E.g., “PC in Sales VLAN -> should reach Branch server (ping ok), should\nbrowse internet (http ok, tested by HTTP to fake server), should NOT telnet outside (tried telnet, blocked\nas expected by ACL).” Do this for key scenarios. All tests should align with design goals.\n- Milestone 3:  Configuration review: run show run  on each device and ensure no glaring issues (e.g.,\ndefault  passwords,  missing  service  encryption,  etc.).  Also  note  resource  usage:  Did  you  use  small\nsubnets efficiently? Are there any routing table oddities? Clean up if necessary (like remove any test ACL\nlines, etc.).\n-  Milestone 4:  Save your final Packet Tracer file and also export configs (for your portfolio). Create a\nbrief  Network  Implementation  Report  with  the  diagram,  summary  of  addressing,  summary  of\nprotocols, and verification outputs (like OSPF neighbor table, NAT translation sample, etc.). Even if just\nfor yourself, this consolidates what you’ve built.\n- Checkpoint:  Congratulate yourself – you’ve essentially simulated the job of setting up an enterprise\nnetwork! This capstone ties together months of learning. It should boost your confidence that not only\ncan  you  answer  exam  questions,  you  can  actually  apply  the  knowledge.  This  is  the  bridge  from\ncertification to real-world skill. Use this accomplishment as a talking point in interviews and as personal\nvalidation of your abilities.\nMotivation:  Finishing a project like this is hugely satisfying. Think about how far you’ve come – from not\nknowing what a VLAN or OSPF was, to now building a network with both. That’s tangible progress. If\nparts  of  the  project  were  challenging,  that’s  good  –  better  to  face  challenges  in  practice  than  in\nproduction. Now, any remaining focus can shift fully to exam-day readiness and job prep, knowing that\nyour skill foundation is strong."
      },
      {
        "number": 15,
        "title": "Final CCNA Exam Preparation and Rest",
        "content": "Objectives (Week 15):\n-  Final exam prep : do a last round of practice exams or question banks focusing on weak areas\nidentified. If you have Boson Exam C or other sets, do them.\n- Review flashcards or notes for anything that still trips you up. At this stage, avoid overloading on new\ninfo; just solidify recall and understanding.\n- Go over  exam-day logistics : Ensure you know location if in-person, or setup if online (test your\nwebcam,  internet,  clear  workspace  if  doing  online  proctored).  Have  two  forms  of  ID  ready.  Read\nPearsonVue exam rules.\n- Prepare mentally: in the last 1-2 days before exam, shift to light review and adequate rest . You won’t\ngain much new knowledge cramming last minute, but you could tire yourself. Better to be fresh.\n- Maybe skim through the official exam topics list one more time and say out loud or on paper the main\nconcept of each – if those come easily, you’re set.\n- Plan to arrive early  if going to a center , or be set up early if online.\n- Have a strategy: e.g., initial 10 seconds brain-dump on scratch paper (some do this for subnet table or\nkey acronyms – though some test centers might not allow writing until exam starts, check rules).\n- Confidence: remind yourself of all the work put in. Some anxiety is normal, but trust your preparation.\nYou  have  consistently  scored  well  in  mocks  by  now  and  the  capstone  success  shows  deep\nunderstanding.\n- Exam Day:  Execute your plan calmly. Manage time – if a question is super confusing or long, mark and\nmove on, come back if time. Many find they have extra time at end because they practiced pacing. Use\nany leftover time to review flagged questions.\n- After submitting, breathe – you’ll see the result on screen. We expect a PASS!  If for some reason not\n(stuff happens), analyze and you still have Month 6 to re-focus – but likely you got it.\n- Celebrate achievement – it’s huge. Then short break and onward to job hunting prep.\n42\n\nResources:\n- Test-Day tips articles  – e.g., “What to do on CCNA exam day” blogs, often recommending good sleep,\nlight meal, etc.\n- Pearson Vue tutorial  – if you can find a preview of the exam interface (sometimes they have a generic\ntest tutorial), to know how sim questions look and how to answer drag-and-drop etc.\n-  Online communities  – some people post their exam experience (without violating NDA). It can be\nreassuring  to  read  a  few  “I  passed  CCNA,  it  was  easier/harder  than  I  thought”  just  to  calibrate\nexpectations, but don't let it spook you – everyone’s experience varies.\n- Your support system  – whether friends or family, let them know you have the exam and maybe arrange\nsomething fun after as a reward.\nMilestones & Checkpoints:\n-  Milestone 1:  Achieve passing scores on final practice tests consistently (~85%+). If any domain still\nlingers in 60-70%, do targeted quick refresh (e.g., re-read that chapter summary or watch a short video)\nuntil you’re confident.\n- Milestone 2:  Flashcards all green – by now, you might retire the deck, or just quickly flip through and\nrealize you know it all. If a few sticky points remain (like memorizing some numeric values or IEEE\nnumbers, etc.), decide if it’s worth last-minute memorizing. CCNA is more about understanding than\nrote memorization (apart from subnetting maybe), so focus accordingly.\n-  Milestone 3: Exam completed with passing score.  You’ll get a preliminary pass notification. Huge\nmoment! You can now proudly call yourself a Cisco Certified Network Associate. This is the culmination\nof the 5 months of hard work.\n-  Checkpoint:  With  the  exam  behind  you  (hopefully),  shift  mind  to  leveraging  this  cert:  updating\nresume, sharing the news on LinkedIn, and preparing for job interviews. The final month will focus on\nthat transition.\nMotivation:  This week is about keeping a cool head and trusting your journey. Confidence is earned, and\nyou’ve earned it. Imagine walking out of the testing center with a grin, or seeing “Congratulations!” on\nthe screen. It’s not luck – it’s your dedication paying off. And remember , even beyond the exam, the\nknowledge stays with you. As the CCNA motto suggests, it’s not just a test, it’s training for your career .\nGo get that cert!"
      }
    ]
  },
  {
    "number": 6,
    "title": "Post-CCNA Career Preparation",
    "focus": "With CCNA in hand, time to land that job! Month 6 (which might start immediately after passing or overlap if you took exam in Month 5) is devoted to job search prep: polishing resume, practicing interview questions (technical and HR), labbing any practical skills for interviews, and continuing to learn (perhaps start looking at CCNA specialization or CCNP topics lightly, to discuss future plans in interviews). We’ll break it into 4 weeks with tasks, but you can adjust based on your situation (you might already be in a job and just need to leverage CCNA for promotion, etc.). We assume you’re seeking a network engineer role or NOC/helpdesk that values CCNA.",
    "weeks": [
      {
        "number": 16,
        "title": "Update Resume and Online Presence",
        "content": "Objectives (Week 16):\n- Update your  resume/CV : Highlight the CCNA certification (and mention knowledge of specific skills\nfrom it). Also add any hands-on projects (like the capstone you did, home lab setups). Emphasize\npractical skills: e.g., “Configured and managed VLANs, OSPF routing, and ACLs in lab environments.”\n43\n\n- If you have prior IT experience (even in helpdesk), tailor it to show networking exposure or relevant\nproblem-solving.\n- Keep resume concise (1-2 pages), focus on skills and achievements. Possibly add a lab section or\npersonal projects section, since as a beginner that shows initiative.\n- Create or update your LinkedIn : add CCNA cert (you can add via Cisco’s Cert manager to verify). Write\na  bio  that  you  are  a  certified  network  engineer  excited  about  networking.  Connect  with  people\n(recruiters, network engineers, people from local Cisco user groups).\n- Clean up your online presence (if any professional footprint beyond LinkedIn) – ensure your LinkedIn\nphoto is professional, and no inappropriate public posts elsewhere that employers might see.\n-  Consider  creating  a  portfolio  site  or  GitHub:  maybe  upload  some  sanitized  lab  configs  or\ndocumentation, or a blog post about your study journey. This isn’t required, but can set you apart if you\nenjoy writing or sharing knowledge.\n- Have someone review your resume (a mentor , friend in industry, or even use a free online resume\ncritique service if available). Feedback ensures it’s clear and impactful.\nResources:\n- Resume templates  – find a clean, modern template if you want a refresh. Avoid overly fancy graphics;\nATS (applicant tracking systems) prefer straightforward formatting.\n- LinkedIn examples  – look at profiles of other CCNAs or entry-level network engineers to see how they\npresent themselves.\n- Cisco’s Talent Network  – maybe sign up or see what they list as desired skills; incorporate keywords\n(like “Cisco routers, switching, troubleshooting, TCP/IP, etc.”) into your resume so automated filters\ncatch them.\n-  Professional photo  – if you don’t have one, have someone take a clear headshot of you in business\ncasual.\n- Cert verification  – Cisco has a verification tool; you may get a PDF certificate and ID – mention the ID on\nresume or just say “Cisco Certified Network Associate (CCNA), attained [Month Year]”.\nMilestones:\n-  Milestone  1:  Finalize  resume  with  CCNA  included  and  at  least  one  project/experience  bullet\ndemonstrating networking skills. E.g., “Built a multi-site network in lab using OSPF and implemented\nnetwork security (ACLs, VPN)” – this is from your capstone. Even if lab, it’s relevant experience.\n- Milestone 2:  Update LinkedIn profile to “Open to work” (if job hunting) and with CCNA credential. Post\nan update about achieving CCNA – often that can get attention from connections and maybe recruiters\n(plus congrats that make you visible).\n- Milestone 3:  Ensure other sections are good: short summary in resume emphasizing you are eager to\napply networking knowledge, education updated (if you did any courses, mention Networking Academy\ncourses or self-study).\n- Checkpoint:  You now have a professional presentation to the world as a network engineer . Next, we’ll\nfocus on preparing to deliver in interviews and assessments.\nMotivation:  Marketing yourself might feel different from technical study, but it’s crucial. You earned a\nvaluable cert; don’t be shy to show it off in a polished way. A strong resume and LinkedIn can open\ndoors. Think of it as configuring yourself as the network device now – optimized for discovery by\nrecruiters!"
      },
      {
        "number": 17,
        "title": "Common Interview Questions and Lab Drills",
        "content": "Objectives (Week 17):\n-  Prepare  for  technical  interview  questions :  these  could  be  theoretical  (“Explain  OSPF  vs  RIP”),\nscenario-based (“If a user can’t reach Google, how do you troubleshoot?”), or simple direct questions\n44\n\n(“What is a VLAN? What is subnetting and why is it useful? Describe the TCP handshake.”).\n- Compile a list of ~20 common networking interview questions (Google “CCNA interview questions”).\nWrite out or speak your answers, ensuring clarity and confidence.\n- Particularly focus on areas interviewers love: subnetting on the fly (they may ask you to calculate a\nsubnet or find a subnet ID quickly), troubleshooting approach, and basic definitions.\n- Practice behavioral questions  too (STAR method: Situation, Task, Action, Result): e.g., “Tell me about a\ntime you solved a difficult technical problem” – you can use your labs or projects as examples (“I was\nconfiguring  OSPF  and  neighbors  wouldn’t  form;  I  systematically  checked  parameters,  found  a\nmismatch, resolved it – showing persistence and troubleshooting skills”).\n- If possible, do a mock interview : have a friend pose as interviewer (preferably someone in IT) and run\nthrough questions. Or record yourself answering and critically review (are you concise? Too nervous?\nUsing filler words?).\n- Brush up on any tool or platform mentioned in job listings: e.g., some places might use Ticket systems\n(like  ServiceNow)  –  be  ready  to  say  you  are  familiar  with  the  concept  of  ticketing;  mention\ndocumentation skills (like using Notion or wiki as you did for notes).\n- Revisit labs to ensure you can do simple tasks if asked on spot (some interviews might have a practical\ntest, like configuring a switch or writing an ACL). If you have access to Packet Tracer during an interview\nor whiteboard, practice explaining your steps as you would if they watch you configure.\nResources:\n- Interview question lists:  Many blogs and YouTube videos list top CCNA or network engineer interview\nquestions. E.g., “What is the difference between a hub, switch, and router?”, “How does traceroute\nwork?”, “What is ARP?”, “Describe an IP routing process.”\n- Glassdoor  – search for network engineer interviews at companies to see real questions they got.\n- Mock interview services  – if you want professional help, some platforms connect you with industry pros\nfor mock interviews (sometimes paid).\n- Friends or mentors  – if you know someone in networking, ask if they’d quiz you. They might throw in\ncurveballs which is good practice.\n- Technical practice:  If expecting a technical test, review how to configure basics quickly. Possibly set a\ntimer for yourself to, say, assign IPs to interfaces and get OSPF running in 10 minutes. Speed isn’t\nusually tested in interviews deeply, but you want to show you know your stuff without too much guess.\nMilestones:\n-  Milestone  1:  Create  an  Q&A  list  with  answers  you're  happy  with  for  at  least  20  likely  technical\nquestions. For example, Q: “What’s the difference between TCP and UDP?” – A: “TCP is connection-\noriented, provides reliable delivery with acknowledgments and retransmission, used for things like web\nbrowsing; UDP is connectionless, no guarantee of delivery, used for streaming or DNS where speed is\nimportant.” Practice saying it aloud smoothly.\n-  Milestone 2:  Successfully perform a mock troubleshooting scenario. E.g., friend says: “User can’t\naccess email.” You verbally walk through troubleshooting: “First, I’d ask if others are affected (scope).\nThen check connectivity: ping user’s PC, gateway, etc. Check DNS if webmail. If network, could be an ACL\nor route issue…” – show logical approach. The goal is to demonstrate you have a structured method, not\nnecessarily solve an unknown issue in real-time (they want to see your thinking).\n- Milestone 3:  Identify any weak points that came up during practice. Perhaps you stumbled explaining\nSTP or forgot part of the OSI model. Quickly brush up on those now.\n- Checkpoint:  By now, answering typical interview questions should feel much easier than before your\nstudies.  You  can  talk  about  technologies  confidently  and  also  showcase  critical  thinking  in\ntroubleshooting. This is crucial for convincing employers. Next, we’ll target job search and refining such\ncommunication further .\n45\n\nMotivation:  Remember , an interview is as much about demonstrating your enthusiasm and thought\nprocess  as it is about reciting facts. Given your preparation, you  know  the facts – now convey your\npassion for networking and your problem-solving skills. Every question is an opportunity to show you’re\nnot just certified, but also a great colleague to work with (eager to learn, team-oriented, etc.). Practice\nuntil you feel positive and ready for real interviews!"
      },
      {
        "number": 18,
        "title": "Job Search and Applications Strategy",
        "content": "Objectives (Week 18):\n- Identify target roles: network engineer (entry-level), network administrator , NOC technician, IT support\nwith networking focus, etc., ideally that list CCNA or similar as requirement.\n- Use job boards (LinkedIn jobs, Indeed, Cisco’s own, local companies’ career pages) to find openings.\nAim to apply to multiple jobs per week – job hunting can be a numbers game.\n-  Customize  your  cover  letter  (if  requested)  for  each  job  –  highlight  how  your  skills  match  their\nenvironment  (if  they  mention  Cisco  ASA,  say  you  have  strong  Cisco  knowledge  and  are  learning\nfirewalls, etc.). If no cover letter , your resume should have keywords matching their needs.\n- Use your network: reach out to any contacts in the industry. Let them know you’re CCNA certified and\nlooking for roles. A referral can often get your resume seen.\n- Consider joining professional communities: e.g., Cisco Learning Network, local networkers meetup,\nmaybe user groups (even virtual). Sometimes job leads appear there.\n- Prepare to discuss salary: research typical entry-level network engineer salary in your region. Have a\nrange in mind (don’t bring up unless asked, but be ready). With CCNA, you often have a bump over just\ngeneral IT tech.\n- Keep learning lightly: as you apply, perhaps peek at CCNP topics or SDN trends – not to dive deep but\nto show you’re forward-thinking in interviews (“I plan to pursue CCNP next” or “I’m also exploring\nPython automation beyond CCNA”). This demonstrates initiative.\n- Track your applications (perhaps in a spreadsheet or Trello) – company, role, date applied, status, so\nyou can follow up if needed and prepare for each interview specifically (research each company’s\nnetwork or business, so you can tailor answers).\n- Don’t get discouraged by rejections or silence; it’s part of the process. Use any feedback to improve.\nCelebrate small wins (like an HR screening call) as progress.\nResources:\n- Job postings:  Look at the requirements and responsibilities – note common themes (like maybe many\nwant knowledge of OSPF, BGP (even if you only know basics of BGP), VLANs, etc.). Make sure those\nterms are on your resume if you have exposure (except don’t lie if you truly never touched something).\n-  Cisco Networking Academy Alumni network  – sometimes NetAcad has partnerships or job boards for\nalumni; check that out.\n- Mentor advice:  If you have a mentor or someone who’s a network engineer , ask them to refer you or\nguide you on entry points (e.g., maybe start at an ISP NOC which often hires CCNAs for network\nmonitoring – great learning environment).\n- Recruiters:  Talk to IT recruiters; some specialize in networking roles. They can also give resume tips or\nconnect you with contract positions to get experience.\nMilestones:\n-  Milestone  1:  Apply  to  at  least  X  jobs  this  week  (X  depends  on  availability,  maybe  5-10  quality\napplications). Ensure each application you send has a tailored resume (if needed) and you follow any\ninstructions (some have questionnaires – answer carefully).\n- Milestone 2:  Reach out to at least 3-5 professionals in networking – could be LinkedIn messages (e.g.,\n“Hi, I just got my CCNA and am looking for entry opportunities; I admire your career path, any advice\nyou might share would be greatly appreciated.” – some might not reply, but some will and could offer\n46\n\nhelp). Also, don't hesitate to let friends know; sometimes opportunities come from casual connections.\n-  Milestone  3:  Prepare  a  quick  “elevator  pitch”  for  networking  events  or  introductions:  “I  recently\nbecame  CCNA-certified  and  built  extensive  home  lab  projects;  I’m  excited  to  start  a  career  in\nnetworking,  particularly  in  network  support  or  junior  admin  roles  where  I  can  further  grow  and\ncontribute to a team.” This helps when speaking to recruiters or at job fairs.\n- Checkpoint:  The job search might take weeks or a few months, but you’ve set it in motion. Keep up\nmomentum and while waiting for responses, continue light study or labbing to keep skills fresh (and\nreduce anxiety). Now, final week ahead, we’ll refine any last interview issues and plan continuous\ndevelopment.\nMotivation:  Job hunting can be a job in itself – treat it like part of your study plan. You are selling a\nproduct (your skills) that are genuinely valuable. Each “no” gets you closer to a “yes” statistically, and you\nonly  need  one  yes.  Remember  your  worth  with  CCNA  +  your  dedication  –  not  everyone  has  the\npersistence to do what you did. Use that confidence when reaching out and interviewing. You are not\nbegging for a job; you are offering to help employers with your fresh skills and enthusiasm. That\npositive, proactive mindset will shine through."
      },
      {
        "number": 19,
        "title": "Interview Refinement and Continuous Learning",
        "content": "Objectives (Week 19):\n- By now you may start getting interview calls. This week, focus on any  specific feedback or upcoming\ninterviews . E.g., if you have an interview scheduled with a company that uses Cisco Meraki, read a bit\nabout Meraki dashboard so you can mention it. If one interview revealed a gap (say you got stumped by\na BGP question), do a quick study on BGP basics so you’re better prepared next time.\n- Continue refining soft skills: practice speaking clearly about your experiences, maybe refine a story of\nhow you tackled a learning challenge (e.g., your six-month study journey itself is a great story to show\ndetermination and how you handle a long-term project).\n-  Network  further:  maybe  attend  a  local  networking  meetup  or  an  online  webinar  Cisco  hosts.\nSometimes you can mention these in interviews (“Recently I joined a Cisco webinar on SD-WAN, I’m\nreally interested in how that’s shaping networks” – shows interest beyond just what you had to study).\n- Plan for  continued learning : Many interviewers ask “What are your future plans?“. State that you\nintend to keep advancing – maybe plan CCNP Enterprise or DevNet Associate next, or that you’re\ncurious about cloud networking (if that’s true). This signals you’ll grow with the role.\n- If job offer comes in (woohoo!), analyze it: consider role duties and growth opportunity, not just salary.\nAs an entry-level, you want a place where you can learn from senior engineers and get hands-on. If\nmultiple offers, weigh pros/cons (maybe consult your mentor).\n- Even after landing a job, schedule time for continuous improvement. But for now, let’s focus on acing\nany final interviews.\nResources:\n-  Advanced topics glimpses:  If applying to places with more advanced tech (like BGP, NAT64, wireless\ncontrollers), you may not know deeply but a Cisco Live presentation or NetworkChuck video on that\ntopic can give you talking points.\n- Community help:  The Cisco Learning Network forums have career sections – you can ask for advice or\nread others’ stories of getting first job.\n- Etiquette:  If you get offers or rejections, know how to professionally handle them (e.g., thank them for\nconsideration even if rejected – sometimes they keep you in mind for future if you’re gracious).\n- Personal development:  Maybe pick up a book on professional soft skills or time management – this can\nindirectly improve your workplace readiness.\n47\n\nMilestones:\n-  Milestone 1:  Evaluate how interviews are going. If you’ve done a few, what pattern of questions\nemerges? Are there any you consistently struggle with? Focus on those now intensely. Perhaps mock\nanswer in front of a mirror until it’s smooth.\n-  Milestone 2:  If you have an upcoming technical assessment or second-round interview, prepare\nspecifically: e.g., review that company’s tech stack (maybe gleaned from job description) and be ready to\ndiscuss those topics. Also have some intelligent questions to ask them (like “I saw you use EIGRP – are\nyou planning any migration to OSPF or BGP? What’s the team’s approach to new technologies?” – shows\nyou care and think ahead).\n- Milestone 3:  Keep applying if needed. Aim to fill your pipeline – interviews often come in waves. The\nmore you do, the more confident you become.\n- Checkpoint:  By end of Month 6, ideally you have landed a job or are in late stages. If not, don’t despair\n– sometimes it takes longer . Keep up applications and maybe seek feedback from each interview to\nimprove. Use the CCNA community for support. The key is not to stagnate: while searching, maybe start\non CCNP ENCOR study or labs to stay sharp and become even more qualified. That could be integrated\nas next steps (though beyond this plan’s scope).\nMotivation:  You've transformed from a beginner to a certified professional with a plan. That’s huge! Now\nthe challenge is to get someone to give you that break – and they will, because your preparation shows.\nStay persistent and maintain the learning mindset. The end of this 6-month plan is really the beginning\nof your career journey. The habits you built – regular study, lab practice, note-taking – will serve you well\non the job and for future certs. Be proud of how far you’ve come, and get excited for what’s ahead. You\ngot this!\nCCNA 200-301 Exam Blueprint Topics Reference\n(For quick lookup, all official exam topics are listed below – ensure you've covered each in the study plan\nabove.)\n1.0  Network  Fundamentals:  Network  components  (Routers,  Switches,  Firewalls,  APs,\nControllers, Endpoints, Servers, PoE) ; Topology architectures (2-tier , 3-tier , spine-leaf, WAN,\nSOHO, cloud) ; Physical media (fiber vs copper , Ethernet modes) ; Interface/cable issues\n(collisions,  errors,  duplex/speed) ;  TCP  vs  UDP ;  IPv4  addressing  and  subnetting  (incl.\nVLSM) ; Private vs public IPv4 ; IPv6 addressing and prefix (link-local, global, etc.) ; IPv6\naddress types (global unicast, unique local, link-local, anycast, multicast, EUI-64) ; Client IP\nsettings (verify on Windows, Mac, Linux) ; Wireless basics (nonoverlapping channels, SSID, RF,\nencryption types) ; Virtualization fundamentals (servers, containers, VRFs) ; Switching\nconcepts (MAC learning & aging, frame forwarding & flooding, MAC address table) .\n2.0 Network Access:  VLANs (normal range) on multiple switches – access ports, default VLAN,\ninter-VLAN connectivity ; Interswitch connectivity – trunking (802.1Q), native VLAN ;\nLayer 2 discovery protocols (CDP/LLDP) ; EtherChannel (LACP) configuration ; Spanning\nTree Protocol (Rapid PVST+) – purpose and basic operations (root bridge, root port, port states,\nPortFast) ; Cisco Wireless architectures & AP modes (e.g., autonomous, controller-based)\n; Physical WLAN components and connections (WLC, APs, switches, management access like\nSSH/HTTPS) ; WLC GUI for WLAN configuration (create WLAN, set security like WPA2, QoS,\nadvanced settings) . •\n5\n6 7\n113 8\n9 79 114\n1213\n83\n115 116 85\n14\n•\n8715 16\n17 18\n1920\n117\n118 21\n119\n48\n\n3.0 IP Connectivity:  Interpret routing table components (route source codes, prefix, network\nmask, next hop, AD, metric, gateway of last resort) ; Determine router forwarding\ndecisions (longest prefix match, then AD, then metric) ; Configure and verify IPv4 & IPv6\nstatic routes (including default route, network route, host route, floating static) ; Single-\narea OSPFv2 configuration & verification (neighbor adjacencies, network types like point-to-point\nvs broadcast DR/BDR, Router ID) ; Purpose of first-hop redundancy protocols (HSRP, VRRP,\nGLBP) – concepts of virtual gateway for redundancy .\n4.0 IP Services:  NAT (configure & verify inside source NAT  – static mapping and NAT pool for\nPAT) ;  NTP  (configure  &  verify  NTP  client  and  NTP  server  mode) ;  DHCP  and  DNS  in\nnetwork  (DHCP  provides  IP  config  to  clients;  DNS  resolves  names  to  IPs) ;  SNMP  in\nnetwork operations (monitoring via SNMP gets/traps) ; Syslog (use of logging facilities and\nseverity  levels) ;  Configure  DHCP  client  and  relay  (e.g.,  ip helper-address ) ;  QoS\nconcepts – QoS (Quality of Service) traffic prioritization (classification and marking, queuing,\ncongestion management, policing, shaping) ; Configure device remote access via SSH (enable\nSSH  server  on  Cisco  device,  e.g.,  generate  RSA  keys,  set  domain,  use  local  AAA) ;\nFunctions  of  TFTP/FTP  in  network  (file  transfers  for  config/images,  smaller  vs  larger  file\nconsiderations) .\n5.0 Security Fundamentals:  Key security concepts (threats, vulnerabilities, exploits, mitigation\ntechniques) ; Security program elements (user training, awareness, physical access controls)\n; Device access control using local passwords (console, VTY, enable secret) ; Password\npolicies  (complexity,  change  schedule,  multi-factor  auth,  certificate/bio  alternatives) ;\nRemote access vs site-to-site VPN definitions (VPN technology ensures secure communication\nover untrusted networks) ; Configure & verify access control lists (IPv4 ACLs – standard and\nextended – to filter traffic) ; Layer 2 security features (DHCP snooping, Dynamic ARP\nInspection, port security on switches – to prevent common L2 attacks) ; Authentication,\nAuthorization,  Accounting  (AAA)  concepts  (what  each  means,  e.g.,  AAA  server  usage) ;\nWireless security protocols (WEP, WPA, WPA2, WPA3 differences) ; Configure WLAN with WPA2\nPSK via GUI (on WLC or wireless router) .\n6.0  Automation  &  Programmability:  How  automation  impacts  network  management  (e.g.,\nsimplifies  repetitive  tasks,  reduces  errors,  allows  scaling) ;  Comparison  of  traditional\nnetworks vs controller-based (the latter centralizes control and uses automation, e.g., Cisco DNA\nCenter) ;  Controller-based  and  software-defined  architectures  (overlay/underlay\nnetworks,  fabric  concepts,  separation  of  control  plane  vs  data  plane,  northbound  and\nsouthbound  APIs) ;  Compare  traditional  device  management  vs  Cisco  DNA  Center\n(command-line  per  box  vs  centralized  GUI/API  with  automation) ;  REST-based  APIs\ncharacteristics (CRUD operations mapping to HTTP verbs GET/POST/PUT/DELETE, uses JSON or\nXML payloads) ; Configuration management tools capabilities (Puppet, Chef, Ansible – use\ntemplates/recipes to push configs, often with version control, automate provisioning) ;\nInterpret JSON encoded data (understand key-value structure in JSON output or config data)\n.\nYou’ve reached the end of the 6-month plan – equipped with knowledge, skills, and a roadmap for career\nsuccess. Best of luck on your CCNA exam and the exciting networking career ahead!•\n232425\n25120\n2691\n2829\n30\n•\n31 32\n9696\n34\n35 36\n37\n121 39\n122 40\n•\n41\n42 44\n4546\n106\n107 50\n5251\n105\n54\n56\n•\n123\n124 110\n108 58\n60\n6162\n6364\n65\n66\n170\n49\n\nPassed CCNA 200-301. Recommended Study Materials and Tips. : r/ccna\nhttps://www.reddit.com/r/ccna/comments/jgylcp/passed_ccna_200301_recommended_study_materials/\nExclusive Cisco 200-301 CCNA Syllabus |\nUpdated 2025\nhttps://www.nwkings.com/cisco-ccna-syllabus\nCCNA 200-301 Syllabus\n2026: All You Need to Know\nhttps://www.theknowledgeacademy.com/blog/ccna-200-301-syllabus/\nMicrosoft Word - 200-301-CCNA-v1.0 edited.docx\nhttps://learningcontent.cisco.com/documents/200_301_CCNA_v1.0_2.pdf\nShare Your Top 3 CCNA Exam Study and Preparation Tips\nhttps://learningnetwork.cisco.com/s/question/0D56e0000BzmFX7CQM/share-your-top-3-ccna-exam-study-and-preparation-\ntips\nCCNA 200-301 Full Course | Jeremy's IT Lab\nhttps://courses.jeremysitlab.com/p/ccna\nOSI Model Reference Chart - Cisco Learning Network\nhttps://learningnetwork.cisco.com/s/article/osi-model-reference-chart\nLab#1.1 - OSI model in practice | NetworkAcademy.IO\nhttps://www.networkacademy.io/ccna/network-fundamentals/osi-model-in-practice\n3.5.5 Packet Tracer – Investigate the TCP/IP and OSI Models in ...\nhttps://itexamanswers.net/3-5-5-packet-tracer-investigate-the-tcp-ip-and-osi-models-in-action-answers.html\n6 Different types of Network Topology Architectures\nhttps://www.nwkings.com/types-of-network-topology-architectures\nThe All-In-One OSI Model Cheat Sheet 2025 - StationX\nhttps://www.stationx.net/osi-model-cheat-sheet/\n[PDF] Routing TCP/IP, Volume II (CCIE Professional Development)\nhttps://elhacker .info/manuales/Redes/Cisco/Routing/Routing%20TCP%20IP%20Volume%202.pdf1 467 71111 112\n212 13 14 41 42 51 53 55 94 95 98 99100 101 102 103\n3 8 910 11 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38\n39 40 43 44 45 46 47 48 49 50 52 54 56 57 58 59 60 61 62 63 64 65 66 79 83 84 85 87 88\n89 91 96 97105 106 107 108 109 110 114 115 116 117 118 119 120 121 122 123 124\n5 6 790113\n68\n69 70 72 73 76 77 80 81 92 93\n74\n75\n78\n82\n86\n104\n50"
      }
    ]
  }
]